{"meta":{"title":"Grey Writing Blog","subtitle":"Grey SubTitle","description":"Grey Description","author":"Grey Lee","url":"http://yoursite.com"},"pages":[{"title":"About Grey","date":"2018-03-20T16:49:38.463Z","updated":"2018-02-25T10:52:52.002Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"Developer. Writer. Traveler. Developer.현재는 대한민국에서 일을 하고 있는 개발자. 때는 2005년, 19살, 고3.“너는 뭘 제일 잘하니?”진로상담시간에 툭 던진 담임선생님의 이 질문을,만 하루간 곱씹으며 게임을 하다가‘아,그래 내가 컴퓨터 앞에서 밤새는 건 누구한테도 안 지지.’라는 깨달음을 새벽 3시에 얻고 얼토당토 않은 배짱으로 컴퓨터공학과에 입학. 1학년 때 Hello World 를 콘솔에 찍고도 그게 Hell World 의 복선임을 눈치채지 못 함.C 와 어셈블리, 납땜과 임베디드 프로그래밍를 학부 생활 중에 실컷했더니정작 취업시즌이 되어 스마트폰 광풍이 몰아닥치사 부랴부랴 안드로이드도 겸했는데인간만사 새옹지마라, 취업 했더니 학생때 때려죽여도 안 한다던 Web 개발이 주업무가 되어 있음. Writer.초등학교 2학년, 어머니를 따라 재래시장에 갔다가 시장 입구에 위치한 지하 서점을 들렀는데거기서 아무생각없이 꼬리달린 꼬맹이가 주홍빛 구슬을 모으는 내용의 책을사달라 어머니를 졸랐던 것이 도서계에 발을 들인 계기가 됨.그 이후로 소년,순정등 장르를 가리지 않고 마구잡이로 읽어댔더니어느새 집 근처 3대 도서대여점에서 적립 포인트 원탑을 초,중,고 내내 유지함.결국 더 이상은 신간이 아닌 이상 읽을 만화가 없게되자 자연스레 소설로 눈을 돌렸고중2때 가즈나이트라는 판타지 소설을 접한 이후로 글이라는 매개체에 매료되어버림.판타지라는 비문학을 통해서 문학으로 넘어온 흔하디 흔한 케이스였고읽을만큼 읽었으니 나도 내 세계를 펼쳐보길 원해서 펜을 잡은 흔하디 흔한 케이스임.중3때 처녀작을 쓰기 시작해 고등학생땐 잠깐 우리나라 3대 판타지 소설 사이트에서 활동도 함.당시 썼던 소설은 총 3부작의 연대기로 5년간 기획되었지만 사이트 폐쇄와 운명을 함께 함.이후 글을 쓰는게 너무 좋아서 글을 쓰며 살고 싶다고 부모님께 고했다가밥 빌어 먹고 살 놈이라며 18년 인생사에서 가장 호되게 욕을 먹었으나이를 계기로 탈선하고 엄마아빠가 뭘 알아! 를 외칠 정도의 간덩어리는 없는 오장육부와고3 담임선생님의 질문으로 인해 글쟁이가 아닌 개발자로 전직함.그러나 여전히, 일상처럼 글을 써왔고 계속해서 쓰는 중이며지금도 개발자 보다는 글쟁이로 소개하는 것을 더 선호함. Traveler.A to Z의 모든 것을 내가 하고싶은 대로 할 수 있는 여행의 매력에 매료된 여행가.죽기전엔 세계일주를 할 거라는 원대한 목표를 가지고 있음.2017년에 본격적으로 여행의지에 불이 붙어, 비행기만 12번을 탔으며이 글을 쓰는 2018년 2월 기준으로 2개월에 한 번씩 출국 할 예정.이제 그만 좀 가라던가, 아직도 갈 곳이 남았냐는 질문을 들을떄면세계지도를 펼쳐 보여주며 내가 간 곳을 하나씩 짚어보는데,그럴때면 죽을때까지 뼈빠지게 다녀도 못 가볼 나라들이 가득함을 상대에게 상기시켜 줌.한 달 용돈 20만원을 받던 대학시절엔 방학때면 전국 8도를 돌며 국내여행만을 다녔고한 달 월급을 받는 지금은 국내는 이제 됐다 싶어서 해외여행을 실컷 하는 중.영국, 프랑스, 스위스, 몽골, 일본, 중국, 홍콩, 베트남, 이태리, 스페인, 포르투칼, 독일, 체코를 다녀왔으며올해는 일본, 마카오, 크로아티아, 슬로베니아, 오스트리아, 헝가리 여행 예정…이지만 더 추가될 수도 있음.여행의 가장 큰 매력은 첫 줄에서도 말했지만 A to Z 까지 모든 것을 내 마음대로 하는 것이라 생각 중.등교, 혹은 출근을 위해 일어나야 해서 일어나고 내일이란 이름으로 기다리는 현실을 위해 자야하니 자고해야할 일이라는 명호로 건내진 더미들 속에서 인지하고 이해하고 오늘도 살아가는 그야말로 현실적인 삶 속에서일어나고플때 일어나고 자고싶을 때 자고 하고 싶은 일이니까 하고, 혹은 하고싶지 않으니까 안 하는여행이야말로 인간 본연의 자유의지가 극대화되는 것이라고 생각하며 거기에서 오는 희열에 매료되어 여행가를 자청함."},{"title":"Tags","date":"2018-03-20T16:49:38.467Z","updated":"2018-02-15T06:19:51.000Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""},{"title":"Categories","date":"2018-03-20T16:49:38.468Z","updated":"2018-02-15T06:19:51.000Z","comments":true,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"[여행] 베트남, 하노이 사파","slug":"post","date":"2018-03-20T13:44:04.000Z","updated":"2018-03-20T16:56:42.245Z","comments":true,"path":"2018/03/20/post/","link":"","permalink":"http://yoursite.com/2018/03/20/post/","excerpt":"00-1.이 여행의 발단 작년, 그러니까 2017년의 10월. 4번째 유럽 여행이었던 독일-체코를 다녀온 직후였다. 10월 12일에 귀국을 했으니, 19일인 그 날은 딱 일주일 되던 날이었다. 꽤나 정신없이 일상에 적응해가던 때였다. 인천에는 오후 1시에 도착을 했고 같은 날 내 사원증은 오후 3시에 회사 출입문에 태그되었다.","text":"00-1.이 여행의 발단 작년, 그러니까 2017년의 10월. 4번째 유럽 여행이었던 독일-체코를 다녀온 직후였다. 10월 12일에 귀국을 했으니, 19일인 그 날은 딱 일주일 되던 날이었다. 꽤나 정신없이 일상에 적응해가던 때였다. 인천에는 오후 1시에 도착을 했고 같은 날 내 사원증은 오후 3시에 회사 출입문에 태그되었다. 20여일이 조금 안 되는 여행이 무색하게도 현실로 돌아오는 시간은 그리 길지 않았다. 묵직한 카메라를 매고 높지 않은 지붕들로 가득찬 골목골목을 한가로이 거닐면서, 하이, 헬로하고 인사하며 시원한 맥주와 함께하던 나날들. 내가 유럽을 다녀 온 꿈을 꾼 건가, 싶은 생각이 들 정도로 현실은 코 앞에 와 있었고 이미 내 손은 키보드를 두들기고 눈은 모니터를 쫓고 있었다. 그래서 그렇게 맞이한 10월 19일, 목요일. 아마 점심을 먹고 오후일과를 시작하던 때쯤 이었던 것 같다, 사당거주민들의 단톡방이 알림으로 반짝이기 시작한 것이. 내가 사는 사당에는 총 4명의 회사 동기가 살고 있다. 사당에 있는지도 몰랐는데 이사 올 때가 되어서 알아보니 어쩌다 알게 된, 가장 먼저 사당에 자리를 잡고 있던 공채 10명반의 홍일점이자 술을 되게 좋아하고 술에 취하면 꺠는 걸 싫어해서 술 먹고 노래방 가는 걸 좋아하지 않는, 센척은 되게 하는데 속은 또 전형적으로 여리고 아닌 척 하면서 주변 신경많이 쓰는 YE. 기가 막힌 타이밍으로 내가 사당에 이사오기 일주일 전에 이사를 들어온, 인연이다 못 해 이제는 이사 타이밍까지 이어지나 싶을 정도로 신입사원 연수때부터 같은 팀이었고 같은 계열사로 와서 같은 팀에 소속되어 10명남짓한 공채반에서 함께 수업을 듣고 지금까지 연을 이어오는 GY. 멀쩡한 집 놔두고 술 먹으러 사당오다가 결국 독립까지 해버린, 이선균 목소리가 트레이드 마크인데 평소엔 안 하다가 술 좀 먹이면 종종 봉골레 파스타 하나를 외치는, 인간이란 왜 일을 해야 할까를 일상처럼 질문해대는 쓸데없는 철학가이자 늘 찡찡대면서 내게 툭툭 털털대는 YS. 거기에 멀쩡히 상암에서 출퇴근 지근거리로 잘하다가 느닷없이 사당 갈 거라며 이사를 와놓고는 여태까지 바쁜척은 오지게 하면서 집들이를 하지 않는, 술은 공채 10명 중에 제일 못 먹는 주제에 쓸데없는 술부심을 부리는, 제주도 출신이며 되게 어벙한데 되게 순박하고 착해서 또 쓸데없이 정이가고 정도 많은 큰 곰 같은 HJ. 적고보니 정말 개성 넘치는 동기가 아닐 수 없네.그렇게 반짝이기 시작한 대화의 시작은 GY 였다. 지금 J 항공 3월 특가 떴다, 난 친구들이랑 라오스 지름 처음엔 늘 그렇듯 점심 후니 졸리기도 하고 잠도 깰 겸 시시콜콜하 이야기나 하나 싶었는데, 특가 항공권 이야기를 꺼낸 것이다. 참고로 GY는 내가 독일-체코를 간 시기에 남미를 한 바퀴 죽 돌고 온 동기였다. 나보다 하루인가 이틀 정도 늦게 출국했는데 귀국은 한 사나흘 정도 늦게 했었다. 내가 너무나 가보고 싶어하는 우유니 사막과 마추픽추는 물론 아르헨티나까지 섭렵하며 다니는 내내 나의 부러움을 사기도 했었다. 그런 녀석이 느닷없이 J항공의 특가 소식을 알린거다. 여행 다녀온 지 얼마나 됐다고…? 사실 그 즈음에 나는 여행에 대한 권태기가 오던 시기였다. 2017년은 유독 해외여행을 많이 다닌 해였다. 학교후배인 YG와 12년지기 절친 JH와 함께 떠났던 2월의 후쿠오카를 필두로 4월말~5월초의 황금연휴의 떠난 To the Galaxy의 몽골. 일본 먹거리의 본고장이라 불리우는 6월의 오사카. 그리고 연이은 7월에 회사 선배들과 방문했던, 보이스카웃 수련대회 이후 20년만에 방문한 제주. 그리고 얼마 전 다녀온 독일-체코까지. 이미 10번의 비행기를 탔던 상태였고 심지어 두 달 뒤인 12월에 오사카를 한 번 더 갈 예정이었다. 그럼 도합 12번의 비행기를 타는건데, 단순 수치로 보면 두 달에 한 번은 비행기를 타고 밖으로 나갔다 왔으니, 지칠만도 했다. 오죽하면 옆 자리의 책임님이 한국사람 아니지 않냐고 놀릴 정도다. 외국인은 3개월에 한 번씩 비자 만료되니까 맞춰서 나갔다 오는 거 아니냐고…듣다보면 참 그럴듯하다. 그래서 아, 내년엔 여행도 좀 쉬어야겠다. 추석에도 이제 그만 나가고 본가에도 좀 가고 그래야지. 아, 아니면 추석에 부모님 모시고 한 번 정도나 나갔다 올까? 라며 다가올 2018년을 생각하던 중이었다. 그런데, 그랬는데, 특가라니? 내가 항공권을 지르는 경우는 딱 2가지 조건을 만족했을 때다. 하나, 특가인가. 둘, 가기 좋은 날인가. 첫 번째 조건을 예로 들자면, 갈 수 있는 곳마다의 가격 정책 마지노선이 나름 정해져 있다. 일본은 대략적으로 16만원 이하, 중국은 20만원 이하, 유럽은 100만원 이하. 일본의 경우에는 지역마다 가격의 상한이 달라지는데 후쿠오카는 12만원, 오사카와 오키나와는 16만원, 삿포로는 25만원정도 선이고 유럽의 경우에는 100만원 이하면 거의 80% 정도 질러야겠다는 마음을 먹은 상태라고 보면 된다. 특히나 유럽은 처음 갔을때 120만원이라는 고가의 항공권을 구매하고도 2번이나 트랜스퍼를 겪으며 편도 37시간의 비행으로 다녀온 경험-물론 떠나기 2주전에 급 지른 여행이라 당연히 비쌀 수 밖에 없었지만-이 있기에 100만원이하에 트랜스퍼 0~1회라면 내게는 너무나도 좋은 조건으로 생각이 될 수 밖에 없다. 두 번째 조건으로 언급한 가기 좋은 날이냐, 는 것의 의미는 휴가를 며칠이나 써야 갈 수 있는 곳인가, 이다. 매년 3월에 리셋되는 나의 연차는 최대 15일이다. 한 달에 하루를 쉬어도 3개가 남아서 되게 여유로워보이지만, 사실상 휴가라는 것은 붙여써야 제 맛이다. 특히나 나처럼 유럽병이 들어있는 여행자들은 전체 일자 중 최소 반절은 유럽여행에 투자를 해야하기 때문에 실로 모자라지 않을 수가 없다. 그렇기에 항공권이 아무리 저렴하더라도 휴가를 많이 써야한다면 섣불리 항공권을 지르지 않는다. 게다가 항공권 구매층을 봐도 평일 항공권의 경우엔 아주 싸다. 주말이 TOP라면 평일 항공권은 자판기 믹스커피 정도수준 일때도 많다. 하지만 평일에 그 항공권을 산다는 건 나로써는 휴가를 써야 한다는 의미고 그렇게 되면 휴가라는 추가 비용이 발생하는 것이기에 두 번째 조건으로 가기 좋은 날인가를 따지는 것이다. 게다가 우리 회사에 경우에는 자율 출퇴근제가 시행되고 있기에 금요일 오후에 출국하고 월요일 오전에 귀국하여 출근을 하면, 휴가를 하나도 쓰지 않고 3박 4일의 해외여행을 할 수 있는 것이다. 그래서 이 점을 이용하여 일본이나 중국과 같이 가까운 나라는 최대한 부담없이 다녀올 수가 있었다. 사실 그래서 올해만 2,6,12월에 일본을 가는 것도 그러한 이유에서다. 셋 다 특가로 구매한 가격이고 휴가를 전혀 쓰지 않고 다녀오는 항공권이다. 그런 조건으로 항공권을 구매해오던 나에게 일단, 1차 조건을 만족하는 말이 GY로 부터 흘러나온 것이다.","categories":[{"name":"travel","slug":"travel","permalink":"http://yoursite.com/categories/travel/"}],"tags":[{"name":"여행","slug":"여행","permalink":"http://yoursite.com/tags/여행/"},{"name":"베트남","slug":"베트남","permalink":"http://yoursite.com/tags/베트남/"},{"name":"travel","slug":"travel","permalink":"http://yoursite.com/tags/travel/"},{"name":"vitenam","slug":"vitenam","permalink":"http://yoursite.com/tags/vitenam/"}]}]}