{"meta":{"title":"Grey Writing Blog","subtitle":"Grey SubTitle","description":"Grey Description","author":"Grey Lee","url":"http://yoursite.com"},"pages":[{"title":"About Grey","date":"2018-03-20T16:49:38.463Z","updated":"2018-02-25T10:52:52.002Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"Developer. Writer. Traveler. Developer.현재는 대한민국에서 일을 하고 있는 개발자. 때는 2005년, 19살, 고3.“너는 뭘 제일 잘하니?”진로상담시간에 툭 던진 담임선생님의 이 질문을,만 하루간 곱씹으며 게임을 하다가‘아,그래 내가 컴퓨터 앞에서 밤새는 건 누구한테도 안 지지.’라는 깨달음을 새벽 3시에 얻고 얼토당토 않은 배짱으로 컴퓨터공학과에 입학. 1학년 때 Hello World 를 콘솔에 찍고도 그게 Hell World 의 복선임을 눈치채지 못 함.C 와 어셈블리, 납땜과 임베디드 프로그래밍를 학부 생활 중에 실컷했더니정작 취업시즌이 되어 스마트폰 광풍이 몰아닥치사 부랴부랴 안드로이드도 겸했는데인간만사 새옹지마라, 취업 했더니 학생때 때려죽여도 안 한다던 Web 개발이 주업무가 되어 있음. Writer.초등학교 2학년, 어머니를 따라 재래시장에 갔다가 시장 입구에 위치한 지하 서점을 들렀는데거기서 아무생각없이 꼬리달린 꼬맹이가 주홍빛 구슬을 모으는 내용의 책을사달라 어머니를 졸랐던 것이 도서계에 발을 들인 계기가 됨.그 이후로 소년,순정등 장르를 가리지 않고 마구잡이로 읽어댔더니어느새 집 근처 3대 도서대여점에서 적립 포인트 원탑을 초,중,고 내내 유지함.결국 더 이상은 신간이 아닌 이상 읽을 만화가 없게되자 자연스레 소설로 눈을 돌렸고중2때 가즈나이트라는 판타지 소설을 접한 이후로 글이라는 매개체에 매료되어버림.판타지라는 비문학을 통해서 문학으로 넘어온 흔하디 흔한 케이스였고읽을만큼 읽었으니 나도 내 세계를 펼쳐보길 원해서 펜을 잡은 흔하디 흔한 케이스임.중3때 처녀작을 쓰기 시작해 고등학생땐 잠깐 우리나라 3대 판타지 소설 사이트에서 활동도 함.당시 썼던 소설은 총 3부작의 연대기로 5년간 기획되었지만 사이트 폐쇄와 운명을 함께 함.이후 글을 쓰는게 너무 좋아서 글을 쓰며 살고 싶다고 부모님께 고했다가밥 빌어 먹고 살 놈이라며 18년 인생사에서 가장 호되게 욕을 먹었으나이를 계기로 탈선하고 엄마아빠가 뭘 알아! 를 외칠 정도의 간덩어리는 없는 오장육부와고3 담임선생님의 질문으로 인해 글쟁이가 아닌 개발자로 전직함.그러나 여전히, 일상처럼 글을 써왔고 계속해서 쓰는 중이며지금도 개발자 보다는 글쟁이로 소개하는 것을 더 선호함. Traveler.A to Z의 모든 것을 내가 하고싶은 대로 할 수 있는 여행의 매력에 매료된 여행가.죽기전엔 세계일주를 할 거라는 원대한 목표를 가지고 있음.2017년에 본격적으로 여행의지에 불이 붙어, 비행기만 12번을 탔으며이 글을 쓰는 2018년 2월 기준으로 2개월에 한 번씩 출국 할 예정.이제 그만 좀 가라던가, 아직도 갈 곳이 남았냐는 질문을 들을떄면세계지도를 펼쳐 보여주며 내가 간 곳을 하나씩 짚어보는데,그럴때면 죽을때까지 뼈빠지게 다녀도 못 가볼 나라들이 가득함을 상대에게 상기시켜 줌.한 달 용돈 20만원을 받던 대학시절엔 방학때면 전국 8도를 돌며 국내여행만을 다녔고한 달 월급을 받는 지금은 국내는 이제 됐다 싶어서 해외여행을 실컷 하는 중.영국, 프랑스, 스위스, 몽골, 일본, 중국, 홍콩, 베트남, 이태리, 스페인, 포르투칼, 독일, 체코를 다녀왔으며올해는 일본, 마카오, 크로아티아, 슬로베니아, 오스트리아, 헝가리 여행 예정…이지만 더 추가될 수도 있음.여행의 가장 큰 매력은 첫 줄에서도 말했지만 A to Z 까지 모든 것을 내 마음대로 하는 것이라 생각 중.등교, 혹은 출근을 위해 일어나야 해서 일어나고 내일이란 이름으로 기다리는 현실을 위해 자야하니 자고해야할 일이라는 명호로 건내진 더미들 속에서 인지하고 이해하고 오늘도 살아가는 그야말로 현실적인 삶 속에서일어나고플때 일어나고 자고싶을 때 자고 하고 싶은 일이니까 하고, 혹은 하고싶지 않으니까 안 하는여행이야말로 인간 본연의 자유의지가 극대화되는 것이라고 생각하며 거기에서 오는 희열에 매료되어 여행가를 자청함."},{"title":"Categories","date":"2018-03-20T16:49:38.468Z","updated":"2018-02-15T06:19:51.000Z","comments":true,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2018-03-20T16:49:38.467Z","updated":"2018-02-15T06:19:51.000Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"새벽 4시","slug":"sicha","date":"2018-03-25T19:54:26.000Z","updated":"2018-03-25T20:28:33.852Z","comments":true,"path":"2018/03/26/sicha/","link":"","permalink":"http://yoursite.com/2018/03/26/sicha/","excerpt":"새벽 4시가 넘어가는 시간, 방금 핸드폰 알람이 울렸다.5시임을 알려준다. 일어나야 할 시간이란다.평소라면 제대로 떠지지 않는 눈 사이로 보이는 핸드폰 불빛을 찾아서 손을 뻗었을 거다.그리고 터치 한 번으로 알람을 종료해버렸겠지. 근 2주 동안 하루 평균 4시간 남짓한 잠을 자고 있다.새벽까지 글을 쓰거나 블로그를 만들거나 책을 읽거나, 그렇게 시간을 보내고 있다.오늘은 좀 반대케이스였다. 일찍 잠든 덕에 일찍 깨었났다. 새벽 1시쯤.","text":"새벽 4시가 넘어가는 시간, 방금 핸드폰 알람이 울렸다.5시임을 알려준다. 일어나야 할 시간이란다.평소라면 제대로 떠지지 않는 눈 사이로 보이는 핸드폰 불빛을 찾아서 손을 뻗었을 거다.그리고 터치 한 번으로 알람을 종료해버렸겠지. 근 2주 동안 하루 평균 4시간 남짓한 잠을 자고 있다.새벽까지 글을 쓰거나 블로그를 만들거나 책을 읽거나, 그렇게 시간을 보내고 있다.오늘은 좀 반대케이스였다. 일찍 잠든 덕에 일찍 깨었났다. 새벽 1시쯤. 눈을 뜨고 시계를 마주하니 짧은 침이 1시를 가리키고 있었다.아,내가 어느새 잠이 들었었네.아,어느새 시간이 흘러있네. 다시 잠들까 싶어 몸을 뒤척이는데 후끈한 방안의 열기가 느껴졌다.보일러를 켜뒀던 게 생각났다. 꺼야할까, 고민을 한다. 보일러를 끄면 으슬하니 춥다.저번 주부터 찾아 온 꽃샘추위인지 뭔지 매년 방문하는 VIP급 날씨때문이다.보일러를 켜면 후끈하니 덥다.3월 말에 보일러라니, 개나리피고 벚꽃도 곧 필텐데 열을 보태는 보일러라니. 이러지도 저러지도 못 하는 계절이다.그래서 잠깐 고민을 한다. 켤까, 끌까. 그리고 그렇게 고민을 하는 사이 잊은 게 있다는 걸 깨달았다.아,나 안 자고 지금 뭐하고 있는 거지. 어느새 잠은 깨어버렸다.다시 잠들려고해도 애매한 느낌이다.눈을 감으면 잠이 올까, 싶은 생각이 든다.잠이 들어도 새우잠을 잘 것만 같은 기분이다.졸린 기색이 없다. 잠이 오질 않는다. 그 사이 시계를 본다. 어느새 10여분이 흘러있다.차라리 깨어서 글을 쓸까 고민을 한다. 지난 주말, 글을 전혀 쓰지 못 했다. 불금을 보낸 탓에 토요일은 숙취로 왠종일 누워서 뒹굴거렸고일요일엔 기술 블로그 포스팅으로 인해 여행글도, 일상글도 쓰지 못 했다. 잠시 고민을 한다.그러면서도 스마트폰을 켜서 웹툰앱을 실행한다.월요일이 됐는데, 월요웹툰을 못 봤다.그 상태로 누워서 안경도 쓰지 않은 채 네이버와 다음, 카카오까지 웹툰을 정독한다. 그 틈새로 저녁에 먹은 라면 냄새가 어디선가 솔솔 나는 것 같은 기분이 든다.환기를 해야하는데 미세먼지 농도가 100을 넘었었다.네이버에 조회를 해보니 나쁨이라며 이모티콘이 쭉 찢어진 눈으로 나를 반겨줬다.그 표정을 보니 절대 문을 열면 안 될 것 같았다.그래서 주말내내 창문을 열지 못 했다.폐쇄된 내 집의 공기는 나가지 못 하고 맴돌았고 텁텁해지기만 했다. 물론 환풍기가 오후쯤 돌아서 환기가 어느 정도는 되었겠지만공기청정기든 환풍기든, 창문을 열고 맞이하는 바람과 공기에 비할 바는 되지 못 한다.그래서 창문을 열고 싶은데, 그 이모티콘이 생각났다.한 일자를 뿌려놓은 듯한 그 표정. 비오는 날 창을 열었더니 비 들어온다고 혼내던 어머니 표정같다는 생각이 들었다. 마지막 웹툰을 보고나니 어느새 30분이 흘러있다.시계가 째깍이며 2시에 다가가려 한다.너 안 자? 하고 되물어보는 듯한 느낌이 든다. 이미 자기는 글렀다. 새벽 2시라니.오늘 내가 회사에 가서 할 일과 하루 일정을 곰곰히 생각을 해본다.아,그러고보니 오늘은 유닛 도란도란(회식)이 있는 날이다.점심에 쌀국수집에서 회식을 하기로 했다.그러니까 그 말인 즉슨, 점심시간에 유산소 운동을 할 수가 없다는 이야기다.그럼 차라리 첫 차를 타고 회사에 가서 운동을 해야겠다는 생각이 든다. 그리고 첫 차를 타려면 지금부터 깨어있는게 나을 것 같다는 생각도 든다.겸사겸사 글도 좀 쓰고 말이다. 손을 휘이저어 바닥에 둔 안경을 찾아서 쓴다.침대에서 애벌레처럼 기어나와 바닥을 슬금슬금 기어 보일러를 끄러 간다.기어가는데 바닥이 후끈거리며 뜨겁다.온도를 그리 높게 설정하지 않았는데도 왜이리 뜨거운지 알 도리가 없다. 보일러를 끄고 몸을 뒤집어 천장을 보다가 일으킨다.일단 좀 씻어야겠다는 생각이 든다. 사실, 주말동안 밖에 나갈 일도 없었고 숙취도 있었고해서이틀 간 전혀 씻지를 않았다.머리는 떡져있고 얼굴은 번들거린다.이 상태로 더 깨어있는 건 내가 찝찝해서 그럴수가 없을 것 같다. 어릴 때는 그렇게 씻기 싫어서 3일간 안 씻으면 행복했던 거 같은데지금은 3일간 안 씻으면 찝찝해서 버틸수가 없다. 샤워를 하고 나와서 맥의 전원을 켠다. 13인치 맥으로 글 쓰고 개발하려니, 밖에서는 괜찮은데 집에서는 불편해서 산 32인치 커브드 모니터가 전원이 들어온다.확실히 화면이 커지니 글 쓰기도 그렇고 개발하기도 그렇고 편하긴 하다.심지어 맥북 모니터까지 사용하면 듀얼이라 효율성이 2배는 되는 거 같다. 어제 기술 블로그 포스팅을 위해 켜놨던 터미널과 사파리, 인텔리J가 여전히 켜져있다.유료 IDE인 인텔리J를 겨우 블로그 포스팅용으로 쓰다니.. 일단 글 블로그를 제대로 개설하기로 한다. 일전에 생성을 하고 시범적으로 글 하나만 올려놓고 더 이상 손을 대지 않은 게 생각났다.브런치에 예전에 올렸던 글들과 페이스북에 올렸던 글들을 수집한다. 하나,하나씩 긁어와 포스팅을 생성하고 글을 긁어오고 필요한 이미지들을 리소스로 등록한다. 그러면서 글들을 다시 읽어보고내가 이때 이런 감정이었구나내가 이때 이런 생각을 했었지그래 맞아 내가 이랬었어라는 과거 회상을 하며 일부분 수정을 조금 한다. 글의 맥락이 부드럽지 않거나 오타가 있거나 거리낌이 있다거나 추가가 필요한 내용을 정리한다.마크다운 문법기반으로 글이 재작성되다보니 띄워쓰기나 볼드체에도 주의를 기울인다.너비에 대한 문제도 신경써야 한다. 이래저래 신경을 쓰며 워드화 되어 있는 글들을 긁어온다.시간을 거슬러 올라가보니 2015년의 페북 글까지 긁어왔다. 더 가져올 글들이 없다, 생각을 해보니수기로 적은 다이어리 글들과 생각날 때마다 적어놓은 스마트폰의 메모들,작년에 했던 아이패드에 남긴 정리글들이 떠오른다. 그러고 시계를 보니 새벽 4시가 어느새 훌쩍 넘어있다.첫 차가 4시 반에 있는데, 첫 차를 타려했던 계획은 물 건너갔다. 이왕 이리 된 거 그냥 맘편히 5시 50분에 있는 첫 지하철을 타는 걸로 한다.그걸 타고 가서 러닝머신 1시간을 뛰면 충분하겠지. 그리고 이왕 글을 쓰기 시작한 김에, 지금 이 일상글도 쓰고 싶은 생각이 든다,새벽 1시에 깨서 뒹굴다가 글을 쓰고 일찌감치 출근을 앞두고 있는 지금의 내 생각들을 정리하고픈 생각이. 이 글의 발단은 그렇게 가볍게 시작했고, 나의 주저리는 또 길어지게 된 것이다.이젠 글을 마무리하고, 출근을 해야겠다.","categories":[{"name":"daily","slug":"daily","permalink":"http://yoursite.com/categories/daily/"}],"tags":[{"name":"새벽4시","slug":"새벽4시","permalink":"http://yoursite.com/tags/새벽4시/"},{"name":"시차","slug":"시차","permalink":"http://yoursite.com/tags/시차/"}]},{"title":"[여행] 베트남, 하노이 사파","slug":"vietnam-travel-00-1","date":"2018-03-20T13:44:04.000Z","updated":"2018-03-25T17:15:09.840Z","comments":true,"path":"2018/03/20/vietnam-travel-00-1/","link":"","permalink":"http://yoursite.com/2018/03/20/vietnam-travel-00-1/","excerpt":"00-1.이 여행의 발단 작년, 그러니까 2017년의 10월. 4번째 유럽 여행이었던 독일-체코를 다녀온 직후였다. 10월 12일에 귀국을 했으니, 19일인 그 날은 딱 일주일 되던 날이었다. 꽤나 정신없이 일상에 적응해가던 때였다. 인천에는 오후 1시에 도착을 했고 같은 날 내 사원증은 오후 3시에 회사 출입문에 태그되었다.","text":"00-1.이 여행의 발단 작년, 그러니까 2017년의 10월. 4번째 유럽 여행이었던 독일-체코를 다녀온 직후였다. 10월 12일에 귀국을 했으니, 19일인 그 날은 딱 일주일 되던 날이었다. 꽤나 정신없이 일상에 적응해가던 때였다. 인천에는 오후 1시에 도착을 했고 같은 날 내 사원증은 오후 3시에 회사 출입문에 태그되었다. 20여일이 조금 안 되는 여행이 무색하게도 현실로 돌아오는 시간은 그리 길지 않았다. 묵직한 카메라를 매고 높지 않은 지붕들로 가득찬 골목골목을 한가로이 거닐면서, 하이, 헬로하고 인사하며 시원한 맥주와 함께하던 나날들. 내가 유럽을 다녀 온 꿈을 꾼 건가, 싶은 생각이 들 정도로 현실은 코 앞에 와 있었고 이미 내 손은 키보드를 두들기고 눈은 모니터를 쫓고 있었다. 그래서 그렇게 맞이한 10월 19일, 목요일. 아마 점심을 먹고 오후일과를 시작하던 때쯤 이었던 것 같다, 사당거주민들의 단톡방이 알림으로 반짝이기 시작한 것이. 내가 사는 사당에는 총 4명의 회사 동기가 살고 있다. 사당에 있는지도 몰랐는데 이사 올 때가 되어서 알아보니 어쩌다 알게 된, 가장 먼저 사당에 자리를 잡고 있던 공채 10명반의 홍일점이자 술을 되게 좋아하고 술에 취하면 꺠는 걸 싫어해서 술 먹고 노래방 가는 걸 좋아하지 않는, 센척은 되게 하는데 속은 또 전형적으로 여리고 아닌 척 하면서 주변 신경많이 쓰는 A. 기가 막힌 타이밍으로 내가 사당에 이사오기 일주일 전에 이사를 들어온, 인연이다 못 해 이제는 이사 타이밍까지 이어지나 싶을 정도로 신입사원 연수때부터 같은 팀이었고 같은 계열사로 와서 같은 팀에 소속되어 10명남짓한 공채반에서 함께 수업을 듣고 지금까지 연을 이어오는 B. 멀쩡한 집 놔두고 술 먹으러 사당오다가 결국 독립까지 해버린, 이선균 목소리가 트레이드 마크인데 평소엔 안 하다가 술 좀 먹이면 종종 봉골레 파스타 하나를 외치는, 인간이란 왜 일을 해야 할까를 일상처럼 질문해대는 쓸데없는 철학가이자 늘 찡찡대면서 내게 툭툭 털털대는 C. 거기에 멀쩡히 상암에서 출퇴근 지근거리로 잘하다가 느닷없이 사당 갈 거라며 이사를 와놓고는 여태까지 바쁜척은 오지게 하면서 집들이를 하지 않는, 술은 공채 10명 중에 제일 못 먹는 주제에 쓸데없는 술부심을 부리는, 제주도 출신이며 되게 어벙한데 되게 순박하고 착해서 또 쓸데없이 정이가고 정도 많은 큰 곰 같은 D. 적고보니 정말 개성 넘치는 동기가 아닐 수 없네.그렇게 반짝이기 시작한 대화의 시작은 B 였다. 지금 J 항공 3월 특가 떴다, 난 친구들이랑 라오스 지름 처음엔 늘 그렇듯 점심 후니 졸리기도 하고 잠도 깰 겸 시시콜콜하 이야기나 하나 싶었는데, 특가 항공권 이야기를 꺼낸 것이다. 참고로 B는 내가 독일-체코를 간 시기에 남미를 한 바퀴 죽 돌고 온 동기였다. 나보다 하루인가 이틀 정도 늦게 출국했는데 귀국은 한 사나흘 정도 늦게 했었다. 내가 너무나 가보고 싶어하는 우유니 사막과 마추픽추는 물론 아르헨티나까지 섭렵하며 다니는 내내 나의 부러움을 사기도 했었다. 그런 녀석이 느닷없이 J항공의 특가 소식을 알린거다. 여행 다녀온 지 얼마나 됐다고…? 사실 그 즈음에 나는 여행에 대한 권태기가 오던 시기였다. 2017년은 유독 해외여행을 많이 다닌 해였다. 학교후배인 타로와 12년지기 절친 둘기형과 함께 떠났던 2월의 후쿠오카를 필두로 4월말~5월초의 황금연휴의 떠난 To the Galaxy의 몽골. 일본 먹거리의 본고장이라 불리우는 6월의 오사카. 그리고 연이은 7월에 회사 선배들과 방문했던, 보이스카웃 수련대회 이후 20년만에 방문한 제주. 그리고 얼마 전 다녀온 독일-체코까지. 이미 10번의 비행기를 탔던 상태였고 심지어 두 달 뒤인 12월에 오사카를 한 번 더 갈 예정이었다. 그럼 도합 12번의 비행기를 타는건데, 단순 수치로 보면 두 달에 한 번은 비행기를 타고 밖으로 나갔다 왔으니, 지칠만도 했다. 오죽하면 옆 자리의 책임님이 한국사람 아니지 않냐고 놀릴 정도다. 외국인은 3개월에 한 번씩 비자 만료되니까 맞춰서 나갔다 오는 거 아니냐고…듣다보면 참 그럴듯하다. 그래서 아, 내년엔 여행도 좀 쉬어야겠다. 추석에도 이제 그만 나가고 본가에도 좀 가고 그래야지. 아, 아니면 추석에 부모님 모시고 한 번 정도나 나갔다 올까? 라며 다가올 2018년을 생각하던 중이었다. 그런데, 그랬는데, 특가라니? 내가 항공권을 지르는 경우는 딱 2가지 조건을 만족했을 때다. 하나, 특가인가. 둘, 가기 좋은 날인가. 첫 번째 조건을 예로 들자면, 갈 수 있는 곳마다의 가격 정책 마지노선이 나름 정해져 있다. 일본은 대략적으로 16만원 이하, 중국은 20만원 이하, 유럽은 100만원 이하. 일본의 경우에는 지역마다 가격의 상한이 달라지는데 후쿠오카는 12만원, 오사카와 오키나와는 16만원, 삿포로는 25만원정도 선이고 유럽의 경우에는 100만원 이하면 거의 80% 정도 질러야겠다는 마음을 먹은 상태라고 보면 된다. 특히나 유럽은 처음 갔을때 120만원이라는 고가의 항공권을 구매하고도 2번이나 트랜스퍼를 겪으며 편도 37시간의 비행으로 다녀온 경험-물론 떠나기 2주전에 급 지른 여행이라 당연히 비쌀 수 밖에 없었지만-이 있기에 100만원이하에 트랜스퍼 0~1회라면 내게는 너무나도 좋은 조건으로 생각이 될 수 밖에 없다. 두 번째 조건으로 언급한 가기 좋은 날이냐, 는 것의 의미는 휴가를 며칠이나 써야 갈 수 있는 곳인가, 이다. 매년 3월에 리셋되는 나의 연차는 최대 15일이다. 한 달에 하루를 쉬어도 3개가 남아서 되게 여유로워보이지만, 사실상 휴가라는 것은 붙여써야 제 맛이다. 특히나 나처럼 유럽병이 들어있는 여행자들은 전체 일자 중 최소 반절은 유럽여행에 투자를 해야하기 때문에 실로 모자라지 않을 수가 없다. 그렇기에 항공권이 아무리 저렴하더라도 휴가를 많이 써야한다면 섣불리 항공권을 지르지 않는다. 게다가 항공권 구매층을 봐도 평일 항공권의 경우엔 아주 싸다. 주말이 TOP라면 평일 항공권은 자판기 믹스커피 정도수준 일때도 많다. 하지만 평일에 그 항공권을 산다는 건 나로써는 휴가를 써야 한다는 의미고 그렇게 되면 휴가라는 추가 비용이 발생하는 것이기에 두 번째 조건으로 가기 좋은 날인가를 따지는 것이다. 게다가 우리 회사에 경우에는 자율 출퇴근제가 시행되고 있기에 금요일 오후에 출국하고 월요일 오전에 귀국하여 출근을 하면, 휴가를 하나도 쓰지 않고 3박 4일의 해외여행을 할 수 있는 것이다. 그래서 이 점을 이용하여 일본이나 중국과 같이 가까운 나라는 최대한 부담없이 다녀올 수가 있었다. 사실 그래서 올해만 2,6,12월에 일본을 가는 것도 그러한 이유에서다. 셋 다 특가로 구매한 가격이고 휴가를 전혀 쓰지 않고 다녀오는 항공권이다. 그런 조건으로 항공권을 구매해오던 나에게 일단, 1차 조건을 만족하는 말이 B로 부터 흘러나온 것이다.","categories":[{"name":"travel","slug":"travel","permalink":"http://yoursite.com/categories/travel/"}],"tags":[{"name":"여행","slug":"여행","permalink":"http://yoursite.com/tags/여행/"},{"name":"베트남","slug":"베트남","permalink":"http://yoursite.com/tags/베트남/"},{"name":"travel","slug":"travel","permalink":"http://yoursite.com/tags/travel/"},{"name":"vitenam","slug":"vitenam","permalink":"http://yoursite.com/tags/vitenam/"}]},{"title":"침잠","slug":"chimjam","date":"2018-03-17T11:03:39.000Z","updated":"2018-03-25T18:16:54.719Z","comments":true,"path":"2018/03/17/chimjam/","link":"","permalink":"http://yoursite.com/2018/03/17/chimjam/","excerpt":"결국 나의 목을 졸라 나를 죽여가던 건 나였다.너도, 그 누구도 아닌 내가 나를 죽이고 있던, 거였다. 깊으면서 낮고낮으면서 어두운어두우면서 깊은 곳으로 흔히들 말하는 나락으로 나를 밀어넣었던 건밀어넣은 게 아니었다.밀어놓은 거였다.내가 나를, 나에게.","text":"결국 나의 목을 졸라 나를 죽여가던 건 나였다.너도, 그 누구도 아닌 내가 나를 죽이고 있던, 거였다. 깊으면서 낮고낮으면서 어두운어두우면서 깊은 곳으로 흔히들 말하는 나락으로 나를 밀어넣었던 건밀어넣은 게 아니었다.밀어놓은 거였다.내가 나를, 나에게. 그런 걸 침잠이라고 한다.마음을 가라앉혀서 깊이 생각하거나,분위기 따위가 가라앉아 무거움.그런 풀이로 사전에는 적혀있다. 생각이라는 것의 기원의 끝이 어디인지홀로 남은 방안, 불 꺼진 밤의 고요함 속에서. 나는 애써 무릎을 감싸 끌어안은채 구석에 앉아아무도 없는 구석만을 바라보곤 한다.아무도 없지만 아무것도 없는 건 아니다. 그 시선의 끝에는 늘 무언가가 있었다.온전히 혼자였고 온연히 있을 수 있다.흔들림 없이 지체하며 시간마저 멈춘 듯 했고뿌리는 없지만 굳은 나무처럼 그곳에 오래있었다. 그만큼 했으면, 이만큼 했으면이젠 답이 나와줄만도 하건만아직도 무엇이 부족한건지, 내가 모자란 건지그 끝은 언제나 한 글자 답 하나 없이 허무했다. 왜라는 의문으로 시작한 물음의 여정은해소되지 못한 갈증만을 남긴 채로 응어리만 져버린다.어제도 그러했고 오늘도 그러했고 내일도 그러할거라고알면서도 그 안으로 나를 밀어넣었었고 밀어넣었고 밀어넣을거다. 그렇게 하나, 둘, 셋…빚처럼 쌓여서 나를 좀 먹어간다는 걸 알면서도 느끼면서도멈추지 못 하고 계속해서 쌓아가기만 했던 시간들과 시간들은내가 나를 이해하지 못 해서였다. 나를 이해해 줄 수 있는 사람은 결국 나 밖에 없는데,내가 살아 온 시간과 내가 했던 생각과 행동들을 모두 이해하는 건.내가 나를 이해하지 못 해버리면 어떡해야 할까. 어두운 시선 속 마주했던 방 귀퉁이의 그것이나를 이해해 줄 수 있을 거라고, 나는 믿기라도 했던 것일까. 그렇게 긴 시간을 나는 나를 점점 궁지로 몰아왔고천길 낭떠러지에 세우며 생각하고 고민하게 만들면서 내몰았다.그러다 주변을 보니어느덧 여기는 사지였고 죄수처럼 칼이 채워져 있었으며칼을 든 망나니, 혹은 길로틴의 집행자와 눈을 마주하고 있었다.그들의 칼 끝은 내 삶의 끝을 대변하듯 내 감정의 마지노선을 향해 있었다.그리고 닿았을 때에서야 그들은 결국 나였음을,덩그러니 바닥을 나뒹구는 내 목 위의 시선으로 마주할 수 있었다. 그래, 나는 어느새 자살이란 암초를 떠올리기 시작했고어쩌면 내 삶의 종을 보는 방식이 그것이 아닐까했다.아닐까했는데 겠구나라는 생각이 들었다. 목을 매거나높은 곳에서 떨어지거나깊은 물 속으로 잠기거나핏줄 선명한 손목을 그어버리거나 끝은 결국 하나인데 다양한 방법을 떠올리고 있었다.떠올리며 왠지 모르게 편해지는 내 마음과 감정과 기분에,나는 그게 또 너무 무서웠다. 그리고 그런 매일을 반복하며 내일을 살아가야하는나의 일상이 너무 엉망으로 보였다. 끝이라 하면서도, 내일이라 반복되는 매일이진창이라 소외하는 모순점들조차 모두. 그래서 가라앉았고, 목을 조르다 콜록였고칼날을 들이밀어 십수번이고 찌르고 또 찔러서 상처를 냈다.작은 아픔으로 말미암아 더 큰 아픔을 겪지 않기를 바랐다. 그렇게 버텨왔다.그렇게 버텼다. …그렇게, 버틸 수 있을까.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"침잠","slug":"침잠","permalink":"http://yoursite.com/tags/침잠/"}]},{"title":"하루 용돈이 300원이던 그때","slug":"haru-yongdon-300","date":"2018-03-17T11:00:13.000Z","updated":"2018-03-25T19:11:11.942Z","comments":true,"path":"2018/03/17/haru-yongdon-300/","link":"","permalink":"http://yoursite.com/2018/03/17/haru-yongdon-300/","excerpt":"내가 처음 용돈이라는 걸 받은 게 말야,1995년..그러니까 국민학교 2학년 때였어. 얼마였냐면, 하루에 300원이었어. 그 300원으로 내가 했던 건 말야 정문에 내려주신 아버지의 차가 멀어지는 걸 확인하고근처 문방구로 쪼르르 달려가서 100원짜리 뽑기 기계를 돌리는 거였어.그게 뭐라고 나도 참나, 매일 아침마다 그렇게 돌려댔는지.","text":"내가 처음 용돈이라는 걸 받은 게 말야,1995년..그러니까 국민학교 2학년 때였어. 얼마였냐면, 하루에 300원이었어. 그 300원으로 내가 했던 건 말야 정문에 내려주신 아버지의 차가 멀어지는 걸 확인하고근처 문방구로 쪼르르 달려가서 100원짜리 뽑기 기계를 돌리는 거였어.그게 뭐라고 나도 참나, 매일 아침마다 그렇게 돌려댔는지.100원짜리를 쑤셔넣고 레버를 끼릭, 끼릭 하고 돌렸지.이게 또 한 번에 다 안 돌아가, 반쯤 돌리고 다시 잡고 더 돌려야 해.그러면 안쪽에 장난감 볼들이 한 번 우쿠쿵 하더니 지들끼리 몸을 밀쳐댄단 말야.아, 이제야 생각해보니 그 모습이 제법 익숙해.매일 아침 지하철을 보면 사람들이 그렇게 쏟아져 나오더라, 그래 맞아 딱 그 꼴이야.그렇게 100원이 돈통으로 들어가는 소리가 나면그 소리와 교체된 내 장난감 볼이 나오는 거지.반은 투명하고 반은 불투명하고. 어린아이의 손아귀 힘으로는 그거, 열기가 꽤나 힘들어.“이익” 하고 입 앙다물고 힘을 주는데도 어떤 건 쉽게 열리는데 어떤 건 또 안 그래.그럴때면 문방구 아줌마의 눈치를 슥 보고는 볼을 바닥에 놓고 발로 쾅, 밟아버리지.아, 물론 안에 있는 내용물이 부서지지 않게 적당한 힘으로 말야.그렇게 깨진 볼 사이로 장난감이든 반지든 젤리든 고리든 뭐든 그 모습을 드러내지.사실 그게 뭔지는 중요치 않아. 그저 내가 뽑았다는 게 중요할 뿐이지.하루 용돈의 3분지 1을 넣고 돌려서 얻은 내 것, 그게 중요한 거지.자 이제 내용물을 챙겼으니 슬금슬금 걸음을 옮겨야 되.밟아서 부서진 장난감 볼을 청소하느 건 문방구 아주머니가 꽤나 싫어하는 일이거든.깨진 플라스틱 조각들을 치우는 게 얼마나 귀찮은 일인지는집에서 유리컵 하나 정도 깨본 사람들이라면 다들 알거야. 그렇게 100원이 쓰였지, 매일.그러고 남은 200원은 늘 간식값이었어.나는 학교 입학 전에 유치원을 가지 않고 태권도 학원을 다녔어.왜 태권도 학원이었는지는 모르겠지만, 국민학교 1학년일때 이미 빨간 띠를 매고 있었지.태극 8장까지 마스터한 국민학교 1학년이라니, 멋지지 않아?게다가 1단을 국민학교 2학년때 땄다고. 무려 9살, 나이가 한 자릿수일때.응, 스무살 넘어 군입대한 애들이 일과 외 시간에 투덜대면서 따야하는 그거. 국민학교 2학년은 4교시까지만 하고 하교를 하지.동에서 떠서 서로 진다는 해가 남에 떠서 북을 따시킨다는 12시쯤말야.뭐, 요즘에야 학원이다 과외다 뭐다 애들을 엄청 굴리던데내가 어릴 적엔 딱히 그런 모습이 흔하지도 않았고, 조금 더 솔직하게는그렇게 이리저리 여러 학원을 다닐 정도로 가세가 좋은 것도 아니었어.가세가 좋았으면 용돈이 겨우 300원이었겠냐, 하다 못 해 천원이라도 줬겠지. 그렇다고해서 용돈에 불만이 있었던 건 아니야. 받는 걸로도 감사했으니까.그 어린 내가 봐도 우리 부모님은 정말 고생을 하셨거든.스무살도 채 되지 않아서 시작하신 공장일은 몸을 혹사시키는 3교대였고내 집 하나 없이 공장 한 켠의 셋방살이를 전전해야 했으며하루 12시간이 넘는 일과 늘 기름때를 벅벅 씻어야하는 상처가득한 손. 한 달에 치킨 한 마리 시켜먹으면 행복했었지.가끔 피자를 먹으면 말도 안 되는 행복이었고.어릴 때는 그걸 계산하는 부모님의 손떨림을 미처 못 봤지.그게 손이 떨리는 게 아니라, 마음이 떨리는 거라는 걸.하나 밖에 없는 아들한테, 겨우 한 달에 한끼 맛있는 거 사먹이는 마음이 얼마나 타들어가셨을지. 이야기가 조금 새버렸네. 점심 남짓한 시간에 학교가 끝나면, 학원을 가야했어.학원에선 맞벌이 하시는 부모님의 퇴근 시간까지 시간을 보내야 했었어.태권도 수업 1시간을 듣고 나머지 시간은 학원 사무실에서 숙제를 하거나자유대련이나 구기종목을 하는 수요일이면 한 타임을 더 듣곤 했지. 그리고 그렇게 오랜 시간을 학원에서 보내야하다보니 간식은 필수였지.한창 먹을 나이라는 건 평생의 모든 순간이 그러하지만세포가 활발해서 성장해야 하는 9살의 아이에겐,먹는다 라는 건 일종의 생존공식이라고. 심지어 매일 격한 태권도 수업도 듣는데 그 조그만 아이가 얼마나 배가 고팠겠어. 그나마 다행으로 꼽는 점 중에 하나는 태권도 학원이 국민학교 바로 옆이었다는 거야.학교 담장을 넘어서 차 하나가 다닐 법한 도로를 총총대며 건너면 학원 정문이었어. 당시만 해도 학원들이 지금처럼 삐까번쩍한 건 건물의 고층에 있는 게 아니라그냥 원룸촌 같은 건물에 간판도 없이 유리창에 테이프인지 뭔지 모를 것들로‘태권도 학원’, ‘피아노 학원’등의 글자를 만들어서 아, 저기가 학원이구나 알게했지.내가 다니던 태권도 학원은 그거보다 더 했는데,이게 겉에서 보면 영락없는 공장이야. 왜, 공장에 가면 그런 문들 있잖아.밖에서 보면 되게 두껍고 튼튼해 보이는데 중간에 잠금쇠가 있고그걸 풀고 문을 열면 문짝 평면 그대로 안으로 접히는, 말 그대로 대문의 형태.그런 와중에도 한 쪽엔 사람이 드나들 수 있는 쪽문이 달린 공장 대문.그 문이 늘 나를 반겨줬어. 초입부터 그런 비쥬얼인데 여길 대체 누가 태권도 학원이라고 보겠어?그나마 그 철제 대문 위에 ‘청훈 태권도’라고 적혀 있어서 다행이지,매일 거길 드다드는 조그마한 아이들의 모습을 상상해봐.아이들 특유의 밝음과 쾌활함을 가지고 들어간 아이들이태권도 수업을 하고 나면 다들 지쳐서 퀭하게 나온단 말야.언뜻 보면 완전 앵벌이 소굴이지.오늘은 얼마 벌어왔어? 껌 좀 팔았어? 그런 상상을 했다고 해도 납득해줄 수 있는 비쥬얼이란 거지. 지금에서야 드는 생각이지만, 공장같은 게 아니라 공장이었을거야 분명.그렇게 문을 열고 들어가면 안에는 작은 마당이 있고, 우측켠엔 창고쓰이던 곳이 있었어.구르기를 연습하던 매트나 발차기로 너덜해지던 받때기가 거기서 늘 나왔거든.그리고 좌측엔 중간중간 노란 솜이 터져나온 쇼파가 놓인 사무실이 있었고정면엔 불투명 유리창으로 이뤄진 미닫이 문이 있었어. 그 문을 열면 태권도장이었지.정말 개미 눈꼽만큼 푹신한 녹색 매트가 깔려있고 한 쪽 벽은 전면유리로 가득찬 도장.뒤쪽엔 저녁반 어른들이나 웨이트 트레이닝 기구도 있었지. “예의, 인내, 백절불굴”을 늘 크게 외치며 태권도 수업은 시작을 했었어.지금 생각해보니 “전방에 힘찬 함성 5초간 발사”랑 비슷했던 느낌이야.다만 어릴때는 좀 더 멋있었던 느낌이었던 거 같은데후자는 되게 멋없고 이딴 걸 왜 시키냐, 내 목청 나간다 같은 불평불만적인 느낌이라는게 차이랄까.그렇게 1시간동안의 태권도 수업을 하려면 배를 넉넉히 채워둬야 했어.채워놓지 못 한 날은 후불제로 채워야했지. 무려 200원어치의 후불로.200원으로 지금할 수 있는게 뭐가 있습니까, 라고 묻는다면 잠시 고민을 해봐야 할 거 같아.글을 쓰는 지금도 책상을 슥 둘러봤는데 어느 것 하나 200원으로 살 수 있는 게 없어.어젯 저녁에 먹은 맥주 한 캔도, 읽은 책 한 권도, 조금 전에 졸려서 마신 커피 한 캔도 못 사고연필통에 가득 꽂힌 볼펜들 중에 어느 하나도 살 수 있는 게 없지.포스트잇이나 A4용지를 낱장으로 판다면, 그래 한 4~5장 정도는 구매가 가능하겠다. 하지만 당시에는 말야, 김이 모락모락 나는 떡볶이 한 접시가 200원이었다고.당시엔 컵볶이라는 것도 없었어. 자판기에서 뽑아 먹는 커피 한 잔 정도 사이즈의 종이컵에떡볶이를 넣어서 판다고? 그걸 누구 코에 붙이고 누가 양심없이 그딴 양을 팔아먹어, 인심없게?걸어가고 있으면 동네 할머니들이 어느 집 자식이누, 아이고 귀엽다 하면서 손에 알사탕 쥐어주는게 예사인데한 손보다 작은 종이컵에 떡볶이를 담아, 그거 뭐 떡 몇개나 들어간다고?대여섯번 푹 냠 푹 냠 해버리면 사라질텐데 그걸 조막막한 손을 가진 코묻은 애들 돈 받고 팔다니.집 근처 봉봉(트램펄린)을 15분 동안 즐기고 달달한 설탕차를 마셔도 300원을 내던 때니까말야. 녹색바탕에 흰 점박이 무늬가 찍힌 플라스틱 접시에 빛깔 좋은 떡볶이가 늘 담겨나왔지.학원 바로 옆에 붙어있는 문방구였는데, 문방구치고는 물품이 적었어.암만 생각해도 그 집의 주력상품은 연필,스케치북,크레파스 같은 게 아니라 그 떡볶이였던 거 같아.주 고객층이 애들이다보니 매운 맛 보단 단 맛에 집중한 맛이었지.생각해보면 먹어본 지 20년이 넘었는데, 난 그 떡볶이만큼 맛있는 떡볶이는 못 먹어본 거 같아.물론 매운 맛이나 단 맛이나 맛의 다양성과 취향의 존중성으로 인해 절대레벨로 채점이 불가하지만내 기준을 토대로 채점을 해보자면 서른 둘의 시간속에서 가장 맛있었던 떡볶이는 그 떡볶이였어.떡은 푹 삶은 듯 딱딱하지 않고 말랑했던 덕에 포크로 푹 찔러도 저항감 없이 들어올릴 수 있었지.그렇게 들어올리면 붉지않고 투명한 떡볶이가 들리는 거야.특이하지? 떡볶이가 새빨갛지가 않았어. 간장떡볶이나 짜장처럼 검지도 않았지.위에서도 말 했듯이 매운 맛보단 단 맛이 강한 떡볶이였어.다만 그 사이사이로 고춧가루들이 있어서 매콤한 맛을 좀 더 가미해줬달까.지금 생각해보니 조청의 끈적하고 달달한 맛이었던 것도 같은데, 정확히는 모르겠어.문방구 아주머니의 비법요리인데 내가 그것까지 알리가 없잖아?내가 그때 알았던 건 200원으로도 충분히 이렇게 맛있는 떡볶이를 먹을 수 있구나 라는 거였어. 뭐, 그렇다고 늘 그렇게 떡볶이만 먹었던 건 아녔어.학교 뒷문에 있던 구멍가게에선 꽁꽁얼린 콜라맛 아이스크림이 한 개에 100원이었거든.해가 눈이 부신 여름날엔 아이스크림도 곧잘 사먹었지.그러고 100원이 남으면 학원에서 친구를 꼬시곤 했지.“나 100원 있는데 합쳐서 떡볶이 먹지 않을래?” 300원으로 누릴 수 있는게 참 많았던 거 같아.며칠이고 가지고 놀 수 있는 장난감 뽑기도 100원이었고배고픔을 달래주던 떡볶이는 200원이었지더위를 식혀주던 아이스크림은 100원이고 말야.친구와 시간을 보내는데도 100원이면 충분했지. 그랬었던, 300원인데 말야.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"용돈","slug":"용돈","permalink":"http://yoursite.com/tags/용돈/"},{"name":"300원","slug":"300원","permalink":"http://yoursite.com/tags/300원/"},{"name":"국민학생","slug":"국민학생","permalink":"http://yoursite.com/tags/국민학생/"}]},{"title":"중고나라 키보드 거래","slug":"keyboard-junggonara","date":"2018-02-24T19:47:58.000Z","updated":"2018-03-25T19:50:08.809Z","comments":true,"path":"2018/02/25/keyboard-junggonara/","link":"","permalink":"http://yoursite.com/2018/02/25/keyboard-junggonara/","excerpt":"음악을 켜고, 글쓰기. 블로그 + 하루정리글을 쓸 용도로기계식 청축 키보드를 중고거래했는데 …약속장소에 왠 초등학생이키보드 박스를 옆구리에 떡하니 끼고 서 있어서 당황1(아,그래서 카톡 프사가 없었나 싶었다) 계좌이체로 할랬는데 계좌가 없대서 당황2(아,초등학생이니까 그럴 수 있겠다 싶었다)","text":"음악을 켜고, 글쓰기. 블로그 + 하루정리글을 쓸 용도로기계식 청축 키보드를 중고거래했는데 …약속장소에 왠 초등학생이키보드 박스를 옆구리에 떡하니 끼고 서 있어서 당황1(아,그래서 카톡 프사가 없었나 싶었다) 계좌이체로 할랬는데 계좌가 없대서 당황2(아,초등학생이니까 그럴 수 있겠다 싶었다) 별수없이 근처 ATM기를 찾아서 방황하는데본인의 몸체만한 21단식 큰 바퀴 자전거를 끌며뒤에서 따라오는 아이의 시선에, 들고 튀면 자전거로 뒷목을 채버리겠구나-라는헛웃음나는 상상을 하면서 돈을 인출해 나왔는데아차, 키보드가 8만 5천원이다. 물어보니 거슬러 줄 5천원이 없대서 당황3(아,계좌도 없는 애가 5천원같은 큰 돈이 어딨나 싶었다) 또 굳이 마트를 찾아가서 잔돈을 바꿔서 돈을 주고.잘 쓰겠다며 인사하고 돌아서지하철 계단을 따라 내려오는데 문득, 내 손에 들린 이 키보드의 정가와(네이버 기준 17만원)구매이력이 2018년 1월이라는 점.그리고 내가 건내 준 8만 5천원이 생각나면서 고작 한 달여만에 반값으로내게 팔아치운 이 키보드는 정말 저 아이의 구매품일까.혹시나 형, 아버지 혹은 누군가의 것을용돈이 필요해 스리슬적 팔아버린 게 아닐까 그래서 어쩌면 오늘 집에가서등짝 스매싱을 감내해야 하지 않을까.그런 줄 알았다면 까짓 5천원, 거스르지말고파스라도 사다 붙이라고 9만원에 쿨거래 할 걸. 그러는 한 편으로,반값에 건내받은 이 키보드가우리집에 도착해서는 잘 동작할까?초등학생한테 중고나라를 통해 사기를 당했다면경찰에 사기죄로 신고가 가능한가?그러고보니 계좌이체가 아니니현금내역증빙은 어떻게 하지?초등생은 사기죄로 고소당하면소년법에 의해 감량받으려나,그래서 쟤 보호자를 만나면 어떻게 A to Z 를 설명한다.제가 블로그 포스팅과 글을 쓰려는데 키보드가 필요해서요, 부터 시작해야하나아냐, 그냥 필요했다고 하자.굳이 물으면 그제서야 사유를 말하지 뭐. 그리고 집에 도착해 이틀째,정가 17만원짜리의2018년 1월에 구매가 된 기계식 키보드는우리집 오크색 이케아 책상 위에둥지를 틀고 잘 동작하며따깍딸칵이는 소리와 함께내게 혹사당하는 중이다. T와 Y가 바뀌어있다는 것,좌측 Ctrl키가 격하게 딸깍이는 점이1차 흠으로 발견되었지만이 정도는 8만 5천원 DC니까 감내할 수 있을 정도다.","categories":[{"name":"daily","slug":"daily","permalink":"http://yoursite.com/categories/daily/"}],"tags":[{"name":"키보드","slug":"키보드","permalink":"http://yoursite.com/tags/키보드/"},{"name":"중고나라","slug":"중고나라","permalink":"http://yoursite.com/tags/중고나라/"}]},{"title":"세상에 우연은 없다","slug":"woyeon","date":"2017-01-21T18:40:06.000Z","updated":"2018-03-25T19:11:02.523Z","comments":true,"path":"2017/01/22/woyeon/","link":"","permalink":"http://yoursite.com/2017/01/22/woyeon/","excerpt":"세상에 우연은 없다. 글을 쓰는 사람이우연을 바라는 건, 가당치 않은 일이다.","text":"세상에 우연은 없다. 글을 쓰는 사람이우연을 바라는 건, 가당치 않은 일이다.모든 이슈는 치밀해야하며사건의 간극은 첨예해야하고기로 띄우고 승으로 놓이며전으로 펼치고 결로 매듭을 짓는다.원인이 있기에 명백한 결과가 단락되며문을 연 이가 있어 닫는 이가 있고태어났으니, 죽음이 있다. 우연히 만나고우연히 일어나며우연히 발생하는,그런 건 세상에 있을 수가 없다. 그래서 글을 쓰는 사람은우연을 믿지 않고 바라지 않는다.전개에 있어서 우연만큼 써먹기 좋은 것은 없지만글로 그려낸 자신만의 세계에모든 인과를 해치는 우연을 넣는다는 건글을 쓰는 사람은 해선 안 되는 일이다. 우연은 그저 멀쩍기 좋은 핑계로 남아야 한다.우연히 가다가…우연히 보여서…우연히 그냥… 사람들이 말하는 그 모든 우연들은하나의 선택과 마주한 둘의 선택,셋과 넷,그 이상의 선택들이 모여들어서우리는 아직 알지 못 하는 세계의 법칙을 따라서-혹은, 신이라는 존재가 가늠하는 견좌에서촘촘히 짜여서 맺어낸 결과일 뿐이다. 우연, 같은 건 세상에 없다.그러니까 우연을 바라지마라.그럼에도 우연을 바란다면바라는 우연을 우연이라 부를 수 있도록우연을 이룰 수 있는 선택과 행동을 해라. 우연한 일은 절대 우연히 일어나지 않는다.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[]},{"title":"해가 없어서, 소년은 방황한다","slug":"because-boy-cant-see-sun","date":"2017-01-08T13:00:27.000Z","updated":"2018-03-25T17:55:32.576Z","comments":true,"path":"2017/01/08/because-boy-cant-see-sun/","link":"","permalink":"http://yoursite.com/2017/01/08/because-boy-cant-see-sun/","excerpt":"살아가면서 후회하는 일들은 여러가지고 있다.다섯 살때부터 친하게 지내던 죽마고우를,고작 게임 캐릭터 때문에 싸우고 절교를 했던 일. 어릴 때 집 근처 슈퍼마켓에서 주인어르신 몰래 사탕을 훔치고,맛있다고 까서 먹었던 일. 좋아했던 여자아이한테 좋아한다 한 마디 말 못 하고,멀찌거니 서서 주변만 돌다가 그대로 묻어둔 일. 오늘도 주말을 멍하니 보내고,돌아오는 월요일이 되어 ‘아 더 격하게 놀 걸!’하고 후회하는 일.","text":"살아가면서 후회하는 일들은 여러가지고 있다.다섯 살때부터 친하게 지내던 죽마고우를,고작 게임 캐릭터 때문에 싸우고 절교를 했던 일. 어릴 때 집 근처 슈퍼마켓에서 주인어르신 몰래 사탕을 훔치고,맛있다고 까서 먹었던 일. 좋아했던 여자아이한테 좋아한다 한 마디 말 못 하고,멀찌거니 서서 주변만 돌다가 그대로 묻어둔 일. 오늘도 주말을 멍하니 보내고,돌아오는 월요일이 되어 ‘아 더 격하게 놀 걸!’하고 후회하는 일.여러가지가 있다.여러가지가 다양하게 있다.여러가지가 다양하게 누구에게나 있다. 몇 개 일 수도 있고몇 십개 일 수도 있고몇 백개 일 수도 있다. 그 많은 수를 일일이 세면서 살아가는 사람은 없다.나도 그 다난한 후회들을 모두 기억하진 못 한다. 하지만 그럼에도 불구하고 기억하는 후회가 있다.다시 그때로 돌아간다면 그렇게 하고 싶다, 라는 후회. 그런 이야기 주구장창 듣잖아.사람은 태어났을 때 부터 본인이 해야 할 소명을 가지고 태어난다고.근데 그런 거 없어.사람이 태어났으면, 그때 이미 내가 해야 할 소명은 다 한거야.태어났으면 그 목적을 다 한 거야.그러니 이제 살아, 살아가면 되. 내가 기억하는 그의 말, 하나 2007년,‘이번에 안 오면, 니들 평생 후회 할 걸? 킬킬킬’이라고 조악하게 웃던 사람이 있다. 서커스가 이번 콘서트의 모티브라고 하면서사람이 천장에서 휙휙 날아다니고죽었다 깨어나도 다시 못 볼 쇼를 준비했다고,그것도 우리 식구들을 위해서.역대급에 역대를 초월하는 역대급이라고 떠들어댔었다. 해따윈 눈길도 주지 않는 새벽 밤의 늦은 시간.옹기종기 모여 그의 말을 듣는 우리는 킬킬댔었다. 나는 재수를 할 때다.해가 뜨기 전에 독서실에 들어가서그의 목소리를 들으며 집으로 향했다. 20주년 콘서트랬다.‘그대에게’로 데뷔한 그의 20주년.공교롭게도 나의 20번째 생일이 있던 해였다. …… 하지만 나는 가지 못 했다.못 간 걸까, 안 간 걸까.‘미안 마왕…30주년엔 꼭 갈께’라는 생각을 하고 약속했었다. 나는 그게 당연했다.정말 나는 당연했다. 당신이 이렇게 떠날 줄은 몰랐다. 정말…나는 몰랐다.해질녘이 되어 아스라이 바스러지는 해처럼당신이 이렇게 가버릴 줄은 몰랐다. 하루 24시간 중, 겨우 1시간을 나를 위해 쓸 시간이 없는 일상이라면그것은 이미 일상이라 부르기 힘든 일상이다.당신의 삶을 사는 일상인지 일을 하며 살아야 하는 일상인지를 생각해봐라.1시간, 작은 시간이다.한달이면 30시간, 꼬박 하루를 더 하고도 넘는 시간이다.1년이면 365시간, 보름을 지새도고 조금 더 넘는 시간이다.너의 시간에서 24분에 1도 네가 하고싶은 대로 하지 못 한다면이미 너의 일상은 무너져 있다, 곧게 세워라.니 인생은 니 인생이다. 니 삶을 살아라.1시간 동안 뭘 해야 할 지 모르겠다면창문을 열고 밖을 봐라, 하늘을 봐라.파랗든 회색빛이든 뒤섞인 색이든, 하늘을 보고 숨을 쉬고 멍을 때려라.그렇게 나를 위한 1시간을 보내라.제발. 내가 기억하는 그의 말, 둘 외로이 사묻혀 흔들리던 나의 10대에우연히 듣게 된 당신의 저음에 이끌려듣게 된 고스트 스테이션은술은 먹어본 적도 없던 나에게무언가에 취한다, 라는 것이 어떤 건지 알게 해줬다. 나는 당신에게 취해버렸다.바르지 않음이 없었다.당신의 말은 힘겹던 내게 와 닿았고당신의 노래는 내가 소년으로 있을 수 있게 해주었다. 꿈을 꾸고 이상을 쫓는 소년으로 남게 해주었다,당신은 내게 그런 의미가 되었다. 해에게서 소년에게.제목 그대로 나라는 소년에게 당신은 해가 되어 주었다. 20대는 좌절할 자격이 없다.20대가 좌절하면,10대는 무엇을 바라고 20대를 향할 것이며30대는 무엇을 떠올리며 삶을 지향할 것인가.가장 빛나고 예쁘고 멋지고 당당해야 할 너희들이다.좌절하지 마라, 그 단어조차 입밖에 내지 마라.쪽팔리지 않냐, 니들이 좌절한다는 건.넘어졌으면 일어나 다시 걸어.못 걷겠으면 굴러, 20대는 그래도 되.온 몸이 진탕되고 흙먼지에 둘러쌓이고 콜록여도 되.20대는 그래도 되, 그래도 되는 나이고, 그래야 할 나이야.실패해도 되, 실패하면 어때.실패는 얼마든지 해도 되.하지만 좌절은 하지 마.니들은 그럴 자격이 없어. 내가 기억하는 그의 말, 셋 해가 없어서, 소년은 방황한다.당신이란 해를 바라보면서 살아온 소년은,올해 30살이 되었다. 나의 20대는 당신의 말마따나 좌절을 모르고 살았다.좋아하는 사람과 헤어졌을 때도주변에서 바라보는 시선과 압박 속에서도힘들다, 힘겹다 슬퍼지려 할 때에도..창 밖을 보고 하늘을 보고 매일 1시간을 오롯이 나를 위해 보내며민물장어의 꿈을 들으며 나를 다독였고좌절하지 않고 걷고 뛰고 넘어지고 뒹굴었다. 그렇게 나의 20대는 당신과 함께했다. 올해, 나는 30살이 되었다.그리고 당신은 내 곁에 있지 않게 되었다.그래서일까, 이상하리만큼 다난한 일들이 비재하기 시작했고그 틈바구니 안에서 나는 지쳐가는 중이다.키를 잃은 외항선처럼 방향을 잃었고해이된 것처럼 옳고 그름을 판별하지 못 하고 있다.좌우가 바뀐 것도 아닌데 들고 있는 손이 오른손인지 왼손인지조차 헷갈릴 때가 있다.잃은 갈피를 찾아서 책장을 몇 번이고 넘기게 되었다. 이제 20대가 아니다…그럼 이젠 좌절해도 되는 게 아닐까. 이게 다 당신의 부재때문이다.해가 없으니까, 소년이 방황하는 거다.기다릴 사람이 아스라졌는데 stand for you가 무슨 의미가 있는 지.커버린 나는, 무슨 꿈을 꿔야 하는 건지 알려줘야 하는 거 아닌가. 여러분, 나를 믿지 마요.나는 언제고 여러분의 뒷통수를 칠 수 있는 사람입니다.나를 믿어요? 에이 왜 이래요 우리사이에.그런 얄팍하고 심증적이고 미신적인 건 어울리지 않아요.난 빈대떡과 같은 인간이야, 어제 한 말? 오늘도 뒤엎을 수 있어.어제 한 생각이 오늘 옳지 않다고 생각된다면 말야.그러니 나 너무 믿지마요.나를 믿지 말고, 너님들 자신을 믿어요.나중에 내 말 듣고 살다가 내 인생 책임지라고 징징대지 말라고.그러니가, 여러분의 삶이잖아요.여러분이 바라는 대로 나아가세요. 내가 기억하는 그의 말, 넷 믿지 말라면서 믿게 만든다. 해가 지고 들리던 당신의 목소리는 좋았는데해가 져서 사라진 당신의 모습은 어째서 이렇게 싫은 걸까. 10월 27일, 내가 기억하는 또 다른 하루가 된 날.당신의 노래들로 가득 채운 하루.들리는 말, 속삭이듯 귓가에 들리는 당신의 가사. 의미도 없이 잊혀지긴 싫어두려움때문이지만,저 강들이 모여드는 곳성난 파도 아래 깊이한 번만이라도 이룰 수 있다면나 언젠가 심장이 터질때까지흐느껴 울고 웃으며긴 여행을 끝내리 미련없이. 민물장어의 꿈, 신해철. 해가 없어서 소년은 방황한다,다난한 일에 쫓겨 당신의 부재에 슬퍼 그렇게 생각했었다.지표를 정해줄 이가 없어서 갈피를 못 잡는 거라고.너무 답답하니 빛을 비춰줄 사람이 필요하다고. 그런데, 그게 아니었다. 소년이 방황하면 해가 없을 뿐이었다.내가 방황을 하기에 해를 찾지 못 할 뿐이었다.해는 언제나 그곳에 있는데 내가 길을 잃어 찾지 못 한 거였다. 당신이 남기고 간 노래에당신은 여전히 있었다. 24시간 중 1시간도 할애하지 못 한 내 하루에나의 일상은 무너져있었고 다른 일상이 있었다. 이제 그만 일어나 어른이 될 시간이야너 자신을 시험해 봐, 길을 떠나야 해.니가 흘릴 눈물이 마법의 주문이 되어너의 여린 마음을 자라나게 할 거야남들이 뭐래도 네가 믿는 것들을포기하려 하거나 움츠려 들지마.힘이 들 땐절대 뒤를 돌아보지마앞만 보며 날아가야 해너의 꿈을 비웃는 자를 애써 상대하지 마변명하려 입을 열지 마.그저 웃어 버리는 거야.아직 시간이 남아 있어, 너의 날개는 펴질 거야.Now We are flying to the universe.마음이 이끄는 곳, 높은 곳으로 날아가. 해애게서 소년에게, 넥스트(N.EX.T). 내년이면,내가 당신에게 약속한 30주년 콘서트가 열리는 해인데어쩐지 당신을 추모하는 콘서트가 열리는 올해.. 사실 당신의 죽음을, 난 아직 믿지 못 한다.당신의 말을 믿지 말라했으니,지금이라도 괜찮다..내 뒤통수를 얼마든 내어줄테니살아있는 당신을 맞이하고 싶다. 긴 여행을 끝낸다던 당신의 여정은원하던대로 미련이 없었을까. 오늘 보내려던 나를 위한 1시간은이렇게 온전히 당신을 위해 씁니다, 마왕. 보고싶네요, 진짜.보고싶어서, 오늘도 당신의 노래를 듣습니다.. - 해에게서 소년에게, 소년에서 해에게.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"next","slug":"next","permalink":"http://yoursite.com/tags/next/"},{"name":"마왕","slug":"마왕","permalink":"http://yoursite.com/tags/마왕/"},{"name":"신해철","slug":"신해철","permalink":"http://yoursite.com/tags/신해철/"},{"name":"민물장어의꿈","slug":"민물장어의꿈","permalink":"http://yoursite.com/tags/민물장어의꿈/"}]},{"title":"나는 아직 너를 잊지 못 했나, 보다","slug":"i-cant-forget-you-yet","date":"2017-01-08T12:20:04.000Z","updated":"2018-03-25T17:56:49.999Z","comments":true,"path":"2017/01/08/i-cant-forget-you-yet/","link":"","permalink":"http://yoursite.com/2017/01/08/i-cant-forget-you-yet/","excerpt":"한가득, 글을 썼다가 지운다.낯선 이의 다가옴에 햘퀴는 고양이의 손짓처럼펜 끝으로 세 줄, 네 줄을 그어버린다.때로는 칠해버린다, 까맣게.","text":"한가득, 글을 썼다가 지운다.낯선 이의 다가옴에 햘퀴는 고양이의 손짓처럼펜 끝으로 세 줄, 네 줄을 그어버린다.때로는 칠해버린다, 까맣게.아냐, 이건 아닌 거 같아.글이 마음에 들지 않아서가 아니라글이 마음을 담고 있어서다.망설임없이 흐르듯 적어놓고는오늘도 이내 숨기고 싶어서몇 자, 몇 구절 그 짧은 사위를 그어버린다. 그러다 10년도 더 전의 이야기를 오늘 끄적인다. 내 글이 보고싶다던,글에는 쓴 사람의 생각과 마음이 담기기에나에대해 좀 더 알고 싶다며 때쓰던 너의 말이 아직도 내겐 깊이 머물러있다.그 덕에 10년도 더 지났는데연필로 쓴 뒤 읽고 수정하고그 위로 볼펜으로 다시 쓰며 또 수정하고컴퓨터로 옮기면서 다시 수정하며옮기고도 몇 번이나 읽어보고 탈고를 한다. 좀 더 신중하려 애쓰고거짓을 배제하고 사족을 줄여서온전한 나를 담아내려한다. 누가봐도 나에대해 오해하지 않도록.누가봐도 나에대해 생각할 수 있도록.그게 비록 네가 아니라, 누구일지라도. 이런 자전적 글을 끄적일때면몇가지 것들이 거리가 되어 보이는데오늘은 너인가 보다, 어째서인지. 4월도 아니고 7월도 아닌데. 어쩌면 전하지 못 해서가 아닐까…아니면 말하지 못 해서가 아닐까…마지막 인사도 못 해서가 아닐까…? 나는 여전히 네가 부르던바보처럼 살고 있다.서툴고, 모자라고, 어리석고,멍청하고, 의욕만 앞서고, 요령 없이. 거긴 괜찮은지, 잘 지내겠지 하면서도그냥 문득 종종, 네가 궁금하다.아주 가끔은.아주 조금은. 엉엉 울던 그 날 밤의 기억도기별 없이 끊어진 너의 편지도그 덕에 의아했던 나의 물음도그리고 고개를 오르내린 내 원망과 그리움도.써내린 채 보내지 못 한 수취인 불명의 편지도. 드문드문 나오는 너와의 버릇덕에아직 내게 네가 남아있구나 라는 걸 알게된다.영원히 내게 기억되고 싶다던 너의 바람은 이뤄졌고그럴께 답했던 나의 대답은 내게만 남아있다.내가 바보라서. …… 무얼 어찌, 어디서부터, 어떻게 할 지 몰라서보고싶어 무작정 찾아갔던 그 겨울날에결국 전해주지 못 한 채 내 손에 들려있었던 것이네가 좋아하던 장미 꽃다발이 아니라 국화였다면환희 웃는 네 사진 앞에 놓고 돌아설 수 있었을까.누군가 놓고간 새하얀 송이들처럼나도 너를 그 곳에 놓고 돌아설 수 있었을까. 그랬다면 10년의 시간이 지난 지금,내게 네가 남아있지 않다는 걸 생각하면서네가 내게 남아있구나,라고 생각했을까. 말 없이, 그렇게 연락이 그쳐졌던 것처럼말 없이, 그렇게 내게 네가 당연했던 것처럼말 없이, 그렇게 너의 부고를 들었던 것처럼 나는 그냥 문득 종종, 네가 궁금하다.아주 가끔은. 아주 조금은.그렇게, 궁금하다.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"기억","slug":"기억","permalink":"http://yoursite.com/tags/기억/"}]},{"title":"꿈","slug":"dream","date":"2017-01-07T14:01:51.000Z","updated":"2018-03-25T18:03:16.778Z","comments":true,"path":"2017/01/07/dream/","link":"","permalink":"http://yoursite.com/2017/01/07/dream/","excerpt":"","text":"이른 밤, 잠에서 깼을 때방금 꾸던 꿈이 생각나 아쉬웠고다시 돌아가고 싶어 눈을 감았다. 늦은 밤, 다시 깼을 땐꾸던 그 꿈이 무척이나 그리워서다시 보고파 잠을 청했다. 깊은 밤, 눈을 떠 깼을 땐죽은 듯 소란없이 고요해졌음에아, 꿈이었구나하고 돌아가려 했다. 밝은 아침, 눈이부셔 깼을 때지난 밤에 나를 가졌던 꿈들이야속하게도 내게 없음에,따뜻히 덮고 있던 이불만 당겨꾸었던 꿈이 무엇이었나 생각했다. 이미 기억이 나지 않음에도나는 꿈이 애달퍼 애를 썼다.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"꿈","slug":"꿈","permalink":"http://yoursite.com/tags/꿈/"},{"name":"dream","slug":"dream","permalink":"http://yoursite.com/tags/dream/"}]},{"title":"서점은 어디에 있는 걸까","slug":"where-is-bookstore","date":"2017-01-07T12:58:09.000Z","updated":"2018-03-25T19:10:53.288Z","comments":true,"path":"2017/01/07/where-is-bookstore/","link":"","permalink":"http://yoursite.com/2017/01/07/where-is-bookstore/","excerpt":"약속 시간이 조금 비어서 뭘 하며 시간을 보낼까하다가자연스럽게 생각난 곳이 있어서네이버맵을 켜고 ‘주변’검색 카테고리를 눌렀다. 카페도 있고, 베이커리, 주유소, 은행, 병원…왠만한 건 다 있었다, 다 있는데…내가 찾는 그 항목이 없다. 내가 못 찾은 걸까? 분류가 다른 곳에 있나?라는 생각이 들어서 모든 카테고리를 열었지만, 없었다.심지어 노래방, PC방..하다 못 해 당구장도 있는데왜 그 항목이 없는지 선뜻 이해가 되지 않았다.","text":"약속 시간이 조금 비어서 뭘 하며 시간을 보낼까하다가자연스럽게 생각난 곳이 있어서네이버맵을 켜고 ‘주변’검색 카테고리를 눌렀다. 카페도 있고, 베이커리, 주유소, 은행, 병원…왠만한 건 다 있었다, 다 있는데…내가 찾는 그 항목이 없다. 내가 못 찾은 걸까? 분류가 다른 곳에 있나?라는 생각이 들어서 모든 카테고리를 열었지만, 없었다.심지어 노래방, PC방..하다 못 해 당구장도 있는데왜 그 항목이 없는지 선뜻 이해가 되지 않았다.아마도 주변 카테고리에 있는 항목들은국내 최대 검색 사이트라 자부하는 네이버가오랫동안 쌓아 온 데이터를 기반으로사람들의 검색 빈도수를 비롯한여러가지 근거들을 바탕으로 만들었을 거다.. …소위 말하는 유저의 사용성을 고려해서. 거기까지 생각이 미쳤을 때, 난 그 사실이 더 아쉬웠다…그런 입장에서 본다면, 더더욱 그 항목이 있어야 했는데.내가 찾던 항목은 특이한 게 아니다.. 있는 게 너무나 당연했어야 할 ‘서점’ 예전에 어느 글에선가대학가에서 책방보다 많은 게 술집이라,글보다 술로 속을 달래는 술픈 청춘이란 문구를 봤었는데. 상식을 채우라고 있는 머리를장식처럼 달고 다니는 아해들이지식이나마 채울 곳이 서점인데. 책책책 책을 읽읍시다, 가 방송된 게 오래전이긴 하지만뭐랄까..우리나라 사람들이 제일 많이 쓸 거라 예상되는네이버 지도에서, ‘서점’이란 항목이 즐겨찾기에 없다는 걸 보니씁쓸하면서도 이해가 되면서도 마땅찮은 느낌이 든다. …그러다 문득, 예전에 어머니에게글을 쓰면서 먹고 살고 싶다는 말을 했다가밥 빌어먹을 놈이라고 호되게 야단을 맞았던 기억이 났다. 찾는 사람이 없는데, 만든들 무어했을까.읽는 이가 없는데, 쓰는 이가 있어 무어할까…","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"서점","slug":"서점","permalink":"http://yoursite.com/tags/서점/"}]},{"title":"그만 좀 합시다, 진짜.","slug":"noiroze","date":"2016-12-24T18:59:34.000Z","updated":"2018-03-25T19:10:45.359Z","comments":true,"path":"2016/12/25/noiroze/","link":"","permalink":"http://yoursite.com/2016/12/25/noiroze/","excerpt":"사람을 곱게 눕혀놓고육신을 밧줄로 옴짤달싹 못 하게 묶은 다음에15초에 한 방울씩, 그 사람의 미간 위로 물방울을 떨어트린다. 한 시간도 채 지나지 않아서누운 사람은 타종소리보다 크게 물방울 소리가 들리고두 시간도 채 지나지 않아서온 몸에 벌레가 기어가는 듯한 간지러움을 느낄 것이고세 시간이 지날무렵엔15초에 한 번씩 경기를 일으키게 되고네 시간이 지나있을땐공황장애를 비롯한 정신적 장애..즉 소위 말하는 미친 상태가 되어버린다.","text":"사람을 곱게 눕혀놓고육신을 밧줄로 옴짤달싹 못 하게 묶은 다음에15초에 한 방울씩, 그 사람의 미간 위로 물방울을 떨어트린다. 한 시간도 채 지나지 않아서누운 사람은 타종소리보다 크게 물방울 소리가 들리고두 시간도 채 지나지 않아서온 몸에 벌레가 기어가는 듯한 간지러움을 느낄 것이고세 시간이 지날무렵엔15초에 한 번씩 경기를 일으키게 되고네 시간이 지나있을땐공황장애를 비롯한 정신적 장애..즉 소위 말하는 미친 상태가 되어버린다.일제강점기때 순사들이 독립군들한테 하던 고문이라고 알고 있었는데오늘 글을 쓰려고 찾아보니꽤나 오래전 중국에서부터 전해내려 온 고문법이라고 한다. ……난데없이 왠 고문을 찾아보고 이렇게 적으면서 운을 때냐면내가 오늘 좀 짜증이 나서 쓰려는 이야기가딱 저 고문을 받는 피험자 상태이기 때문이다. 2014년 6월 16일, 최종 합격 통지를 받고동년 8월 12일, 지금 다니는 회사에 입사를 했다.그리고 오늘이 2016년 12월 25일이니까대략 2년하고 4개월쯤 됐다. 28개월의 시간이고일로 따지면 850일이 넘는 날이다.시간으로 환산하면 2만시간을 훌쩍 넘긴다.꽤나, 오랜 시간이다. …시간으로 환산하니 정말 긴 시간이네.2만여 시간동안 참고 참았으면이젠 참을만큼 참았다는 생각이 들어서글을 쓰는데 더 거침이 없어진다. 그 긴 시간동안 피험자가 되어내가 맞아온 물방울은이 글을 읽는 당신도 한 번쯤 나에게 했을 법한,연애하라는 소리다. (길었으니 일단 숨 좀 쉬고. 후…ㅡ ㅍㅡ..) 그냥 가볍게 하는 말이고만나면 하는 일상대화 중에 하나고사람이 여럿모이면 으레 나오는 주제지만 그 가볍고 일상적이며 으레 나오는 소리가나에게 노이로제를 일으키는 트리거가 된다면그건 이미 가볍지 않고 일상적이지 않으며으레 나와서는 안 되는 소리다. 적어도 나에게 있어서는.작디작은 물방울 한 방울들이사람을 미치게 만들듯이.만나는 사람마다 죄다 그 소리다. 자주 만나든, 오랜만에 만나든.지위고하, 남녀노소를 막론하고.초중고를 의무적으로 다녔듯이취업했으니 연애도 의무적으로 해야합니까? …… 내가 종종 Here I Stand for you 라는 문구를카톡 상태 메세지로 해두는데,알 사람은 알겠지만이는 신해철의 명곡 중 하나다. 노래의 가사를 조금 인용해보자면나는 그저 지쳐서 필요에 의해 사람을 만나고생활을 위해 살고 싶지는 않다.물론, 가사를 따라서 운명을 믿는 건 아니지만. 좋아하는 사람이 생기면나도 그 사람과 함께 하고 싶고연애를 하고 싶어지는 건 당연한건데 어째서 주변에선 대부분이연애라는 목적 달성만을주구장창 응원하는 건지. 괜찮은 사람이니까,괜찮은 사람인데,괜찮은 사람이야, 그래 알겠어. 근데, 그래서?괜찮은 사람이면 그 사람이랑 연애를 해야 하는 건가.괜찮은 사람이면 그 사람을 좋아해야 하는 건가. 괜찮은 거랑 좋아하는 거랑언제부터 동일한 말이 된 거지. 그러다 혼자 산다, 라는 소리를 하시는 분들도 있는데혼자 살기 싫다고 연애를 해야 하는 건 옳은 겁니까. 제 결혼, 제 인생 걱정 해주시는 분들의 마음은 감사합니다만결혼하려고 연애하고 연애하려고 좋아하는 건,최소한 제 가치관은 아닙니다. 좋아하니까 연애하고연애하다가 못 참겠어서 결혼하는 게제가 가진 생각입니다. 물론 사람의 가치관이 바뀌는데 필요한 건시간이 아니라 순간이긴 하지만어느새 서른도 기울어서 서른 하나가 목전인데제 가치관이 그리 쉽게 바뀔 것 같진 않습니다. 글이 부단히도 길어지는데,거의 노이로제 수준입니다.정신병에라도 걸릴 거 같구요. 가뜩이나 현재를 살아가는 대한민국 국민은기본적으로 5개의 정신병을 앓고 있다는데왜 거기에 하나를 더 추가해주시려는지는제 짧은 소견으론 알도리가 없습니다만은… 그래서 조만간 제가 펑,하고 폭발하는 날이 있을겁니다.감정을 배제하고 정색 할지도 모르고요한 없이 진지한 표정을 지을지도 모릅니다.혹은 육두문자를 뱉으며 감정을 긁어댈지도 모르죠. 제가 또 한 번 빡 돌면 앞뒤좌우위아래사방팔방오천평방미터무한각도급으로 사리분별없이 물어뜯습니다.그런거, 굉장히, 잘 합니다.미친개라고 보셔도 좋을 정도로, 잘 물고 짖어댑니다. …물론 그러고 뒤돌아서서 이불킥 날릴 성격입니다만…그 정도를 감수하고도 터질 지도 모릅니다.그런 감정상태이고 인내심이 바닥을 보이는 중입니다. 제가 터졌을 때 원인제공자가 누가 될 진 저도 모릅니다. 이 글을 읽은 사람일 수도 있고읽지 않은 사람일 수도 있습니다.저와 친한 사람일 수도 있고저와 친하지 않은 사람일 수도 있습니다.매일 저와 마주치는 사람일 수도 있고저와 간간히 봐야하는 사람일 수도 있습니다.당장 내일 터질 수도 있고좀 더 있다가 터질 수도 있으며혹은 빛나는 인내심의 승리로 터지지 않을 수도 있습니다. 다만 터지기 전까지내 속에 쌓임은 커지고 화는 커져갈 뿐입니다.죄는 미워하되 사람은 미워하지 말라지만,전 사람도 미워할 겁니다. 이상, 오늘 글 끝.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"크리스마스","slug":"크리스마스","permalink":"http://yoursite.com/tags/크리스마스/"},{"name":"노이로제","slug":"노이로제","permalink":"http://yoursite.com/tags/노이로제/"}]},{"title":"모순 EP01","slug":"mosun-01","date":"2016-10-15T18:00:32.000Z","updated":"2018-03-25T18:01:25.465Z","comments":true,"path":"2016/10/16/mosun-01/","link":"","permalink":"http://yoursite.com/2016/10/16/mosun-01/","excerpt":"","text":"살면서 짚어지는 짐짓 한 모순 중에 하나는철이 드는 것과 현실에 순응 하는 것을동일시 하는 경향이, 사람들에게 있다는 것이다. 엄연히 그 둘은 다른 건데도.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"모순","slug":"모순","permalink":"http://yoursite.com/tags/모순/"}]},{"title":"오해, 내가 입을 닫았을 때","slug":"when-i-closed-say","date":"2016-10-15T17:21:43.000Z","updated":"2018-03-25T19:43:16.265Z","comments":true,"path":"2016/10/16/when-i-closed-say/","link":"","permalink":"http://yoursite.com/2016/10/16/when-i-closed-say/","excerpt":"못 들은 척 한다라는 말을 들은 적이 있다. 그게 척이 아니라 진짜 못 들은 건데,그 사람이 보기엔 내가 못 들은 척 하는 걸로 보였나 보다.이미 확정적인 시선으로 날 바라보는그 사람의 눈에 뭐라 말을 하려다 입을 다물었다. 아, 어차피 내가 말해도 믿을 생각이 없구나그리고 내가 가만히 있자 다분히본인의 입장에 입각한 비수들을 휘두르기 시작했다. 어느정도는 받아 넘겼는데,넘겼다 생각한 것들이 시간이 지날 수록 곪아서 썩어있었다.썩은채로 긴 시간을 보내고 있었다.그 사람은 내 귀가 좋지 않다는 걸 모른다.그러니 그렇게 생각한 거다.","text":"못 들은 척 한다라는 말을 들은 적이 있다. 그게 척이 아니라 진짜 못 들은 건데,그 사람이 보기엔 내가 못 들은 척 하는 걸로 보였나 보다.이미 확정적인 시선으로 날 바라보는그 사람의 눈에 뭐라 말을 하려다 입을 다물었다. 아, 어차피 내가 말해도 믿을 생각이 없구나그리고 내가 가만히 있자 다분히본인의 입장에 입각한 비수들을 휘두르기 시작했다. 어느정도는 받아 넘겼는데,넘겼다 생각한 것들이 시간이 지날 수록 곪아서 썩어있었다.썩은채로 긴 시간을 보내고 있었다.그 사람은 내 귀가 좋지 않다는 걸 모른다.그러니 그렇게 생각한 거다.…… 어릴 때부터 제일 익숙했던 소리는 무서운 공장의 기계음이다.우리 부모님은 내가 태어나기도 전부터섬유공장에서 일을 하시고 지금도 일을 하신다. 매일 아침 7시에 출근하시고 퇴근은 대중없다.1년에 쉬시는 날은 여름휴가 5일 남짓, 그게 전부다.일요일은 당연히 쉴 거 같지만,멋 모르는 소리다. 난 우리 부모님이 공장에 나가지 않는 날을 본 적이 없다.지금도 주말 저녁에 전화를 걸면 그러신다, 어, 아빠 이제 퇴근하는 중이야.…… 어릴 때, 살았던 집은 늘 공장 한켠 셋방살이였다.처음 공장에 들어가 본 게 아마 4살 때일거다.섬유공장 특유의 실냄새와 쿠쾅,웅쾅 거리는어린 아이가 듣기엔 무섭기 짝이 없는 베틀 기계소리. 고함을 치지 않으면 바로 옆 사람의 말 조차 들리지 않는그 소음더미속에서, 방에 홀로 남은 게 싫던 꼬맹이는어머니 아버지가 일하는 모습을 보며 박스더미 위에 앉아 놀았다. 그러다 베틀에 실덩이가 비어가면잔뜩 쌓인 실타래 중 하나를 들고 뛰어가 빈 실타래를 빼고 갈아끼웠다. 공장의 기계는 멈출 수가 없다. 그래서 어머니는 주간반, 오후반, 야간반을 3주 로테이션으로 일하셨다.아버지는 주간반이지만 사실상 주간+오후반이었고집에와서 찌든 기름때를 씻을때면10시에 시작하던 드라마가 다음회 예고편을 방송하고 있었다. 매주 금요일,토요일.다음날 학교를 가지 않는 때에 내 잠자리는언제나 시끄러운 공장 안이었다. 부모님이 일하는 모습을 보다가실타래가 가득하다 비어버린 박스를 바닥에 깔고그 안에 옹기종기 몸을 구겨넣어서 잠들곤 했다. 그러고 있으면 새벽일이 한가해질 때쯤아버지가 안아서 방에 데려다 주었다.그래서 어릴때부터 제일 익숙했던 소리가 공장의 기계음이다. 집에 손님이 오면 늘 하는 이야기가 있다. TV 볼륨 좀 낮추라고 한다…늘 기계 속에 파 묻혀 살다보니부모님도, 나도 모르는 새에 소리를 듣는 역치가보통 사람들에 비해 많이 높아져 있었던 거다. 그 덕인지, 언젠가부터 나한테 난청이 생겼다.소음성 난청이라고 하는데 말 하는 건 들리지만명확하게 들리지가 않는다. 이게 웃긴 게 늘 그런 것도 아니라서잘 못 듣는다고 주변에 말하는 것도 이상하다.예전에 한 번 말을 했는데 말을 알아 듣는 걸 보고, 구라까지 말라고 하더라.그래서 그 이후론 미리 말 하는 걸 관뒀다. 그냥 못 알아들으면 눈치를 살핀다.웃어야 될 거 같으면 웃고고개 끄덕여야 할 거 같으면 고개를 끄덕인다. 차라리 그게 나도 남도 편하다는 걸 그때 알았다.그래서 그 날도 입을 닫았던 거다. ..아니, 솔직히 말하자면 그 날도 눈치를 봤던 거다.글로 써도 구구절절한 이 이야기를그 상황에서 그 사람에게 납득시키려한들이해해 줄 리 없다는 시선이었으니까. 그리고 무엇보다 거짓없는 내 이야기가한낱 상황을 모면하려는 변명으로 치부당하는 게 더 싫었기 때문이기도 하지만. 잘려고 누웠다가 오랜만에 끄적거리는 게제법 길어져서, 누가 제대로 읽기나 하겠느냐만은.근데 쓰고보니 나 엄청 효자같네. 잘 했어, 어린 날의 나. 니 덕에 효자 코스프레도 좀 했네.그러니까 좀 잘해라, 지금의 나.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"오해","slug":"오해","permalink":"http://yoursite.com/tags/오해/"},{"name":"시선","slug":"시선","permalink":"http://yoursite.com/tags/시선/"}]},{"title":"나이를 먹는 다는 거","slug":"nai","date":"2016-08-28T19:09:18.000Z","updated":"2018-03-25T19:10:21.325Z","comments":true,"path":"2016/08/29/nai/","link":"","permalink":"http://yoursite.com/2016/08/29/nai/","excerpt":"","text":"나이를 먹는 건 괜찮은데나이만큼, 겁도 같이 먹고 있는 것 같아서나는 그게 걱정이 된다. 나는 안정된 삶을 살고 있다.그 안에 안주하고 있다.나는 분명 안심하고 있다. 매달 정기적으로 들어오는 일푼과매일 반복되는 평화로운 일상에..","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"나이","slug":"나이","permalink":"http://yoursite.com/tags/나이/"},{"name":"겁","slug":"겁","permalink":"http://yoursite.com/tags/겁/"}]},{"title":"입사 2주","slug":"ibsa-2-year","date":"2016-08-14T13:12:19.000Z","updated":"2018-03-25T19:22:00.517Z","comments":true,"path":"2016/08/14/ibsa-2-year/","link":"","permalink":"http://yoursite.com/2016/08/14/ibsa-2-year/","excerpt":"동기들끼린 이야기했지만,사실 저번 주 금요일(12일)이 입사 2주년이었습니다.","text":"동기들끼린 이야기했지만,사실 저번 주 금요일(12일)이 입사 2주년이었습니다. 하나.요즘 주말엔 딱히 약속이 없으면점심쯤 집 근처 카페에 와서 저녁먹을 시간까지 있는다. 알고리즘 공부도 하고 회사에서 쓰는 웹 공부도 하고e-Book으로 책도 읽고 소소히 글도 쓰고 있다.다음부턴 드로잉 스케치도 해 볼 생각이다(스케치를 집에서 하면 지우개똥이 장난 아니라…) 주말에 집에만 있으니 자고 뒹굴고 먹고 자느라너무 시간을 버리는 거 같아서의식적으로 나와서 시간을 보내는 건데 이러고 있으니 문득, 예전에 대규형이주말에 카페에서 뭘해도 좋은 스터디를 모집하던 기억이 난다. 둘.멘토 선배의 말을 빌리자면친정집 식구들(첫 PJT 투입지)하고 했던 일들 중에 하나가Github Trend 발간이었다(주간이든 월간이든…) 2015년 초에 내가 몇 번 정도 공유했던 적도 있는데사실 이제서야 말하지만 그땐 잘 알지도 못 하는기술 트렌드를 번역하는게 힘들었다.(누누이 말하지만 전 웹은 정말…지금도 개발하다가 버벅이는게 일상다반사인데눈꼽만큼 나아지긴 했지만 그땐 진짜….기초도 없는 웹알못..ㅠㅠ) 눈 앞에 껄 따라가기도 바빴는데먼 발치에 있는 애들 이해하려니번역은 하는데 번역이 맞는 지 모르는,비전공자가 전공서적을 번역할 때 느꼈을 법한 기분을 느꼈다. 그러다 최근에 문득,이렇게 주말이나 평일 저녁에 끄적댄 것들을월간이든 주간이든 일간이든 잘 정리하고 정립해서주변 사람들에게 나누면 좋겠다, 라는 생각이 들었다.(물론 보고 말고 버릴지 가질지는 받는 너님들 마음) 윤종신이 월간 윤종신을 창간 했을때도 이런 생각이었을까,LEGO 사람들이 깃헙 트렌드를 발간하려고 했을 때도 이랬을까. 여기 있으면 좀 더 재밌는 걸 할 수 있을텐데,라고 킨이 말했었는데, 이미 나는 거기 있지 않고이런 저런 사정들이 직장인들에겐 있는 거고. …여튼, 일간은 조금 힘들것 같고조만간 주간으로 뭔가를 발행할 예정.(알고리즘일수도, 웹일수도, 개발이 아닐 수도?발행이라고 하지만 글이 아닐지도?) 셋.이건 조금 소소한 여담인데요즘 Docker나 React가 개발에 활발히 쓰이는 걸 보면서(React는 요즘 공부중인데 Docker는 정확히 아직 뭔지 모르겠음…이미지 기반 배포라는데…그만큼 내 지식이 얕다는 부끄러운 소리..) 둘에서도 언급했지만 작년 초에 깃헙 트렌드를 발간할 때LEGO분들이 React랑 Docker가 대세가 될 거라 말했었는데15년 하반기가 치닫는 이 시점에 사실이 되어있다.새삼스레 대단한 분들…심지어 atom도 당시에 점프가 바로 써보고 좋다고 했는데지금 이 시점에 내가 회사에서나 집에서나 atom을 쓰고 있음…그러고보니 처음 만들었던 때 스티브 주도하에 썼던 UI 라이브러리가 Material…이것도 지금 쓰고 있다. 1년 반전에 흐름을 읽고 계신 분들이라니, 미래에서 오신건가. 첫 PJT 가서 갔을 때 느꼈던 첫 생각이어떻게 이런 사람들을 한데 모아놨지? 였는데..(그리고 난 아주 잠깐이나마 회사 사람 모두가 그런 줄 알았는데,그럴리가 없지. 역시 거기가 특출난 거였어)(..물론 지금 있는 곳이 안 그렇다는 게 아니라 제가 말하는 그렇지 않다,라는 부분은 좀 더 저 멀리 우ㅣ…..읍읍!!) 너무 직시되는 주변이야기니 급정리를 해보자면 첫 PJT나 지금이나, 이렇게 좋은 사람들이고 능력자들이넘쳐나다 못 해 흥에 겨워 채이는데 [얇고 길고 평화로운 월급쟁이 생활을 위해 여기 쓰여졌던 장문의 토로는 삭제처리합니다, 읽으시는 분들의 양해를 바랍니다] 왜….이래?물론 주어는 뺐음. 넷 중 하나.작은 애가 놀이터 터널 통과를 좀 잘하길래큰 애한테 작은 애 한테 가서 터널 통과하는 노하우 좀 배우고 오렴.그러고 배워 온 큰 애한테 시켜봤더니 애초에 터널이 작아서 큰 애는 들어가지도 못 함.근데 그러고 혼나는 건 큰 애임.아니, 왜? 넷 중 둘.로또를 안 사는데로또 당첨을 바라면그게 놀부지. 넷 중 셋.A : 나 높은 곳에 올라가는 방법을 깨달았어!!B : 오,정말?? 그게 뭔데?A : 니가 아는 걸 내가 모르면 되.B : ……? 넷 중 넷.인스타그램을 4명이서 6주만에 만들었다,라는 말을 하면서(실상 기획부터 최종 런칭까지 1년이 넘지만,뭐 이건 그러려니 하더라도)그걸 토대로 SW역량에 대해서 말하는 걸 듣다보면진짜 개알못들이 본인의 무지함을 뽐내는 거 같다.안드로이드 개발 조금이라도 해 본 사람이면인스타그램 App의 Activity Lifecycle관리가얼마나 개판인지는 백키 몇번만 눌러봐도 알 수 있을텐데.그러니까 내가 3번에서 그럴 수 밖에 없는거다,왜 이런건데 진짜..? 다섯.알 사람은 알겠지만제가 2012년 겨울에 전자에서 인턴을 했었습니다.물론 저는 최종 전환에 실패(1 out)했고,인턴 동기들은 53기로 회사에 잘 다니고 있습니다. 그리고 저는 흔히말하는 속세에 취하고 현혹된채로찌르고(2 out) 찔러보다가(3 out)깨달음을 얻고(SSAT도 아니고 최종 면접 3연벙이라니!!)열반에 오른 후에 55기로 입사를 했죠(물론 전자는 아닙니다, 후자들 중에 하나죠) 그 덕에 현재 회사에서 친한 선배의 친한 동기가제 인턴 동기인 경우가 있습니다. 이거 꽤나 미묘합니다.전 그 동기랑 친했다고 생각했는데그래서 입사 후에 메신져로 말 걸었는데, 높임말…헿…(인턴때 술자리에서 내 드립에 빵빵 터져놓고!!) 뭐,물론 그렇다고해서 선배한테 동기인양 대하겠다는게 아니라..요즘도 종종 엘레베이터에서 마주치는 데손 흔들며 인사하는게 아니라 고개숙여 인사하는 사이라는 게어쩐지 조금 섭섭하면서도 슬픈 감정이 든달까. 인턴 최종전환 이후에도종종 연락하고 지내면서, 올라오면밥 사주고 술 사주고 놀아주던 동기들도 있는데저렇게 서먹해진 동기들도 있다는 게 슬픈거죠.(동기적 관점과 친구적 관점의 차이랄까) 그러고보면 종종 연락하던 인턴 동기들 본지도 오래 됐네요(미안합니다, 수원은 가깝고도 먼 동네인 거 같아요…)우면동에 있는 동기는 이때다 싶어 봤는데..올해 안에 해야 할, 아니 하고픈 일이 글을 쓰다 하나 더 늘었네요.수원에 가서 고마운 인턴 동기들 만나기, 올해 안에. 여섯.첫 마디에 적었지만, 저번 주 금요일이 입사 2주년이었습니다.그리고 전 2년째 페이스북 개인정보에 회사 등록을 안 해 놓았죠. 물론 페이스북이 제 개인정보를 그만 알았으면, 하는 이유도 있지만(어차피 그래봤자 회사분들이 이미 내 페친이기에 의미 없다는 건 알고 있음, 그러니 이건 그냥 뻔히 답을 알면서도 묻는 사람들에게 말하는 그저 그런 대답…) 사실 회사 등록을 안 해놓는 이유는, 저도 잘 모르겠습니다.그냥 하기 싫어서 일수도 있고, 뭐…그래서 현 시점에선 모르겠다는 대답이 맞는 거 같네요.(근데 또 모르겠다고 하면 왜,라고 끊임없이 묻는 분들이 계시거나 자기 멋대로 해석해서 메모리에 넣어두고 나중에 너 그렇게 생각한다며? 하고 묻는 분들이 분명히 있습니다-물론 반농담식으로 놀리면서 하는 분들이 대다수이고 그런 분들은 저도 알고 최소한 이 글을 보는 분들은 안 그런 분들인거 압니다(애초에 그런 사람은 페친으로 안 받습니다, 이런 글 보면 아시겠지만 개인적인 글을 종종 이렇게 쓰기에…) 그럼에도 불구하고 논외로 진심으로 그렇게 말하는 사람이 있습니다, 웃으며 적당히 하라고 해도 웃으니까 적당히 안 해주시는 분들-그래서 저 위와 같은 페이스북이 내 정보 아는게 싫어서요. 라는 대답으로 커버쳐대는 겁니다. 왜냐고 좀 그만 물엌ㅋㅋ 어떻게 사람이 모든 일상에 대해서 명확한 논리와 경험론적 이유를 대면서 삽니까.아무리 삶이 인과율적 논리에 좌우된다지만 전 그렇게 명확하게 사는 인간은 아니라구요. 그냥 좀 삽시다, 그냥.) 선임을 달게 되는 내후년쯤엔 알게 되려나.…라고 적어놓고 보니 문득 드는 생각인데 나 이 회사에서 선임은 달 수 있겠지…? 이상 입사 2주년 기념 글, 끝.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"입사","slug":"입사","permalink":"http://yoursite.com/tags/입사/"}]},{"title":"시선","slug":"sisun","date":"2016-07-29T19:19:53.000Z","updated":"2018-03-25T19:22:00.520Z","comments":true,"path":"2016/07/30/sisun/","link":"","permalink":"http://yoursite.com/2016/07/30/sisun/","excerpt":"가식은, 어느새 그게 내 진심이 되 있었고진심은 어느새 이해치 못 할 거리가 되어서왜,라는 의문으로 내게 견주어져 있었다…","text":"가식은, 어느새 그게 내 진심이 되 있었고진심은 어느새 이해치 못 할 거리가 되어서왜,라는 의문으로 내게 견주어져 있었다…내가 살아가는 내 삶이니까,타인의 이해를 바라는 건 아닌데 내가 살아가는 내 삶이기에그들의 박해를 바란 것도 아닌데 오늘이, 어제가, 그리고 내일이살아가는 매 순간, 눈 깜빡이는 찰나조차나는 버티듯 살아가고 있는데 힘드냐고 물으면 힘들다고 답을 했을 때뭐가 힘드냐고 또 묻기에뭐가 힘들다고 말할 순 없는 미묘함이라. 결국 오늘도 어떠냐는 물음에뭐, 그렇죠 ㅎ…하고 웃으며 구렁이 담 넘듯 넘겨버리는 하루라. 내가 내게 내린 답이 없는데내가 내게 내린 답을 내놓으라는 건네가 내게 바라는 답을 뱉어보란 건지네가 내게 바라지 않는 답을 뱉어보란 건지 뱉은 답에 대해서 가늠하는 건왜 답한 나의 주관이 아니라물은 너의 주관이 뒤섞이는 건지. 산울림 깊숙한 메아리 처럼돌아온 시선은 어째서 내 대답과 달리 변해있는지. 의미가 난장한 이 글은과연 너희에 대한 내 대답을 담고 있는 건지물은 너희가 바란 내 대답을 담고 있는 건지 이해를 바랬던 건 아닌데그런 시선을 바랬던 것도 아니야..","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"시","slug":"시","permalink":"http://yoursite.com/tags/시/"}]},{"title":"그냥, 오늘, 하루","slug":"just-today-haru","date":"2016-07-18T09:38:32.000Z","updated":"2018-03-25T17:42:57.834Z","comments":true,"path":"2016/07/18/just-today-haru/","link":"","permalink":"http://yoursite.com/2016/07/18/just-today-haru/","excerpt":"","text":"제법 오랜만에, 쓰고 싶은 글제가 떠올랐다. 너무 와 닿는 문구라 잊혀지지가 않을 정도여서,요며칠 반듯이 정리하고 정제하는 중인데 결국은 오늘도 내일은 써야지, 하는 마음만 먹은 채로맺음 없이 풀릴 매듭을 지어버린다. 요즘은 매일이 그렇다.완은 없는데 결만 짓고 있다. 그냥 모든 것에 지치는 느낌이다.그게 일이든, 사람이든, 뭐든.내 주변에 있는 모든 것에.그 모든 것을 주변에 둔 나에게까지.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[]},{"title":"아무것도, 아무것도.","slug":"jam","date":"2016-06-07T13:23:17.000Z","updated":"2018-03-25T19:25:07.269Z","comments":true,"path":"2016/06/07/jam/","link":"","permalink":"http://yoursite.com/2016/06/07/jam/","excerpt":"스푼 하나를 들고 냉장고를 열어서선물 받은 수제 잼을 한 숟갈 퍼먹으려 했는데뚜껑을 열었더니 하얀색 곰팡이가 끼어있었다. 어쩐지, 왜 인지는 모르겠지만아깝다, 라는 생각보다슬프다, 라는 생각이 먼저 들었다.","text":"스푼 하나를 들고 냉장고를 열어서선물 받은 수제 잼을 한 숟갈 퍼먹으려 했는데뚜껑을 열었더니 하얀색 곰팡이가 끼어있었다. 어쩐지, 왜 인지는 모르겠지만아깝다, 라는 생각보다슬프다, 라는 생각이 먼저 들었다. 금요일인가, 목요일인가…회사에서 받아온 오렌지를냉장고에 넣어뒀는데본가에 다녀와서 오늘 먹을랬더니단 맛이 다 빠져버려서 맛이 없길래그냥 청소하면서 버려버렸다. 아,같이 받아온 수박은 맛있게 먹었다.그나마 다행이랄까. 청소를 하고 말끔히 털어낸 이불위로폭하니 누워서 눈을 감았더니아무것도 보이지 않는 건 당연한데아무것도 들리지 않는 게 이상했다. 낮게 울음하는 냉장고 모터소리 외에내 숨소리만 들려서 숨을 멈춰봤더니내가 지금 혼자 있구나, 라는 생각이 들었다. 아무것도 아닌 것들의 단상을 보면아무것도 아닌 것들이 나온다. 곰팡이가 슬어서 냉장고에서 꺼내진 잼도단 맛이 빠져서 쓰레기더미가 된 오렌지도책상 귀퉁이에 쌓인 전공 서적도무심히 나를 내려다보는 부모님의 사진도. 포근한 이불에 묻혀 숨을 멈췄던 아주 잠깐의 나도,그리고 바스러지고 뭉개진 내 감정들도. 그저 이렇게 보면 아무것도 아닌 것들에 지나지 않는다. 살아가는 매일이 내겐 버거운데한 걸음만 뒤에서 보면아무것도 아닌 것들에 지나지 않는 다는 것 때문에참았던 숨이 몰려 한 숨이 되어버린다.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[]},{"title":"요즘은","slug":"only-read","date":"2016-01-16T19:26:54.000Z","updated":"2018-03-25T19:42:41.692Z","comments":true,"path":"2016/01/17/only-read/","link":"","permalink":"http://yoursite.com/2016/01/17/only-read/","excerpt":"","text":"요즘은 쓸 생각 없이 읽기만 하고 있다. 몇 가지, 어쩌면 몇십가지의 거리들이하루에도 몇 번이고 아스러지지만스스로가 납득할 정도의 정리가 되질 않아쓰다가도 엇나가 버려 지우기 일쑤다. 그래서 요즘은 마냥 읽기만 하고 있다. 내게 있어서 글이라는 건 최후의 보루고삶의 도피처이며 내 안식의 도구다. 그렇기에 써야 한다는 생각에 쓰고 싶지는 않다.다시 글이 쓰고 싶어지면 그때,혹은 쓰고 싶은 글이 있으면 그때. 하고 싶은 건, 하고 싶을 때. 해야한다.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[]},{"title":"2015년 마지막 글","slug":"2015-last","date":"2015-12-29T14:28:57.000Z","updated":"2018-03-25T19:34:20.077Z","comments":true,"path":"2015/12/29/2015-last/","link":"","permalink":"http://yoursite.com/2015/12/29/2015-last/","excerpt":"序긴 글입니다.온전히 담은 제 생각입니다.탓을 할 의도도 의사도 담지 않은 흰 글입니다.토로가 아니라 정리입니다.올해도 이제 3일 남짓, 기울었으니까요.서장에 어울리지 않는 말이지만, 감사합니다.","text":"序긴 글입니다.온전히 담은 제 생각입니다.탓을 할 의도도 의사도 담지 않은 흰 글입니다.토로가 아니라 정리입니다.올해도 이제 3일 남짓, 기울었으니까요.서장에 어울리지 않는 말이지만, 감사합니다. 初나는 회사에 일을 하러 간다고 생각지를 않는다.나는, 회사에 개발을 하러 간다고 생각한다. 그게 나를 보는 이들과 내가 가진 모순의 시발점이었다. 中一개발을 하다보니 그 자체가 재밌더라구요.뭐, 그러다보니 전공도 남들보다 과하게 찾아듣는 편이었고학점이 모자라면 청강,도강을 하고…그렇게 살았더니 4학년이 되었고 취업을 해야하더라구요.그래서 뭐..개발하면서 먹고 살 수 있으면 좋겠다,라는 생각이 들었는데마침 소엔이라는 조직이 이 회사에 있다는 걸 친한 형에게 듣게 되었고 거기 가면 미친듯이 개발할 수 있다길래,,하하..그래서 지원한 겁니다. 다른 회사 많은데 왜 우리 회사에 지원했느냐는 질문에,나는 저렇게, 솔직하게 말을 했었다. 샵 인클루드 꺽쇠열고 스탠다드아이오 점 에이치 꺽쇠닫고 엔터 엔터보이드 메인 괄호열고 보이드 괄호닫고 중괄호 열고 엔터프린트에프 괄호열고 큰따옴표 헬로월드 돈표시 엔 큰따옴표 괄호닫고 세모콜론 엔터중괄호 닫고 컨트롤 에프오 그리고 까만 창에 띄워진 흰색 글자, Hello World. ..저 두 단어만 제대로 안 떴어도, 이렇게 개발에 재미를 붙이진 않았을텐데.하다 못 해 Hello World 안에 숨어있는 Hell World를 그 때 알아챘더라면 이런 인간이 되진 않았을 텐데ㅋㅋㅋ…이미 늦어버린 후회라, 스무살 마음에 직접 띄운 cmd 창은 신기했고1.44MB 디스크에 .exe 파일만 마우스로 끌어다 놓으면 프로그램을 설치한 거라 생각하던 컴맹은 개발계의 발을 담그게 되었지.늪은 딛어봐야 아, ㅈ됐다 라고 느끼는 거라지. 뜻은 하나지만 의미는 여럿이라..머릿속으로 꽁냥댄 것들을 코드로 옮기고 그게 작동이되는 거.복잡한 연산, 꼬인 것들, 문제들, 처리과정들…뭉텅그려 로직이라 불리는 것들이까만 바탕, 흰 글자 Hello World 처럼 실체화 되는 것.대부분의 사람들이 이해를 하지 못 하겠지만 나한텐 재밌으니까.그게 나한텐 개발이라서 이러고 있는 거지. 조금 일찍 출근하고 조금 늦게 퇴근하는 이유는지금 내가 접할 수 있는 재미거리들이 회사에 있기 때문이야.당연한 소리잖아?나보다 훨씬 실력 좋은 선배들이 만들어놓은 고등 코드들..어디가서도 구할 수 없는 군침거리들이 거기에 있는데.게임으로 치면 유니크 아이템들이 가득한 던전에 들어가는 거라고.이리가고 저리가도 레어,유니크,에픽 템들이 보이는데무게 게이지 만땅 채울때까지 줍줍 해야지. 그리고 거기에서 운수 나쁘게도 모순이 시작되었지. 나한텐 회사가 그런 곳인데대부분의 이에겐 회사가 그런 곳이 아니고그런 곳이 아닌 곳에 이해 안 되는 내가 있고이해를 하는데 이해를 바랄 순 없는 거고왜냐면, 내가 왜? 이기 때문이라서. 中二이런 글, 많이도 썼다가 지웠었다.1년여동안, 회사에 적응하는 동안.욕을 쓴 적도 있었고한탄을 했던 적도 있었고실의도 끄적거렸었고다짐도 몇번이고 했었다. 근데 결국은 쓰다 만 채 다 지웠었고하나도 올리지 않았다,정확히는 올리지 못 했다. 내가 정리가 안 되어서.이해를 다 하지 못 하여서.정말 그런 건 아닐까 의심하느라. 그래서 의심을 의식했다.회사는 일을 하는 곳이다.나는 돈을 받고, 일을 하러 회사에 간다.일은 일이다. 일인데 어떻게 재밌어요?이 짧았던 한 문장의 시발점도 여기였다. 근데, 그게 안 된다.나는 글러먹은 거 같다.ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ ㅋ를 연타하는 것 만큼 적절한 표현이 이 순간 떠오르질 않는다. 어쩌겠냐..잘 하진 못 해도..코드를 보는 게 재밌는데…남들이 만든 로직을 따라 흘러가는 것도 좋고막히는 걸로 머리 싸매는 것도 즐겁다.웹이든 임베디드든 뭐든 간에…뭘 만들든, 만드는 행위..개발 그 자체가 재밌는 걸.. 終계속 될 거다.그런 곳이 아닌 곳에 나는 있을 테니까.…그런 곳이라 하여도 나는 글러먹었으니까. 잘 하고 싶은 생각은 없다.그런 욕심은 나한테 과분할 뿐더러진짜 잘 하는 사람 앞에서 무의할 뿐이다. 그냥 재밌으니까.그냥 하고 싶으니까. 그냥. 왜? 그냥.구구절절 시시콜콜 한 거 다 빼고, 그냥. 회사를 다니고 있고 직장인이라고 이젠 말하지만나는 회사원이기 전에 개발자이고 싶다.잘 하지 못하더라도, 그냥 하는, 하고 있는 개발자. 2015년 마지막 월요일에 쓰기 시작해서 3시간 남짓, 생각들을 쌓고 정리해서…그리고 날을 넘겨 올 해 마지막 화요일에, 끄적거림.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"2015","slug":"2015","permalink":"http://yoursite.com/tags/2015/"},{"name":"연말","slug":"연말","permalink":"http://yoursite.com/tags/연말/"}]},{"title":"과정? 결과?","slug":"gwajung","date":"2015-10-21T19:33:01.000Z","updated":"2018-03-25T19:34:28.199Z","comments":true,"path":"2015/10/22/gwajung/","link":"","permalink":"http://yoursite.com/2015/10/22/gwajung/","excerpt":"","text":"되기 위해서 하는 게 아니라,하다 보니까 되는 거지. 왜 그렇게 보이는 결과에 집착들 하는지…과정이란 이름의 경험은 왜 등한시 하는지.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"과정","slug":"과정","permalink":"http://yoursite.com/tags/과정/"}]},{"title":"Life","slug":"gatabuta","date":"2015-04-06T19:37:06.000Z","updated":"2018-03-25T19:42:06.000Z","comments":true,"path":"2015/04/07/gatabuta/","link":"","permalink":"http://yoursite.com/2015/04/07/gatabuta/","excerpt":"","text":"가타부타 멀거니 짖음에, 잠시 희게 살았구나.완연히 내 것이거늘, 무어 그리 탐하고 궁하는지. 낮게 높음이 어려 부릅뜬 줄 알았건만물러서 보니 염지에 닿지도 못한 아해로구나. 네 높음이 내 낮음과 같으니 어찌 그러했느냐.내 낮기에 올라가는데 네 높기에 설화를 맞으니 하냥 즛틴 길이 나지막이 무르춤하고인제 딛음이 궐 없음에 이는 온전히 내 것이다.","categories":[{"name":"essay","slug":"essay","permalink":"http://yoursite.com/categories/essay/"}],"tags":[{"name":"내삶","slug":"내삶","permalink":"http://yoursite.com/tags/내삶/"}]}]}